espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
/******************************************************************************
*  Filename:       hw_nvmnw_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_NVMNW_H__
#define __HW_NVMNW_H__

//*****************************************************************************
//
// This section defines the register offsets of
// NVMNW component
//
//*****************************************************************************
// Interrupt Index Register:
#define NVMNW_O_IIDX                                                0x00000020

// Interrupt Mask Register:
#define NVMNW_O_IMASK                                               0x00000028

// Raw Interrupt Status Register:
#define NVMNW_O_RIS                                                 0x00000030

// Masked Interrupt Status Register:
#define NVMNW_O_MIS                                                 0x00000038

// Interrupt Set Register:
#define NVMNW_O_ISET                                                0x00000040

// Interrupt Clear Register.
#define NVMNW_O_ICLR                                                0x00000048

// Event mode register. It is used to select whether each line is disabled, in
// software mode (software clears the RIS) or in hardware mode (hardware clears
// the RIS)
#define NVMNW_O_EVT_MODE                                            0x000000E0

// Hardware Version Description Register:
#define NVMNW_O_DESC                                                0x000000FC

// Command Execute Register:
#define NVMNW_O_CMDEXEC                                             0x00000100

// Command Type Register
#define NVMNW_O_CMDTYPE                                             0x00000104

// Command Control Register
#define NVMNW_O_CMDCTL                                              0x00000108

// Command Address Register:
#define NVMNW_O_CMDADDR                                             0x00000120

// Command Program Byte Enable Register:
#define NVMNW_O_CMDBYTEN                                            0x00000124

// Command Program Data Index Register:
#define NVMNW_O_CMDDATAINDEX                                        0x0000012C

// Command Data Register 0
#define NVMNW_O_CMDDATA0                                            0x00000130

// Command Data Register 1
#define NVMNW_O_CMDDATA1                                            0x00000134

// Command Data Register 2
#define NVMNW_O_CMDDATA2                                            0x00000138

// Command Data Register 3
#define NVMNW_O_CMDDATA3                                            0x0000013C

// Command Data Register 4
#define NVMNW_O_CMDDATA4                                            0x00000140

// Command Data Register 5
#define NVMNW_O_CMDDATA5                                            0x00000144

// Command Data Register 6
#define NVMNW_O_CMDDATA6                                            0x00000148

// Command Data Register 7
#define NVMNW_O_CMDDATA7                                            0x0000014C

// Command Data Register 8
#define NVMNW_O_CMDDATA8                                            0x00000150

// Command Data Register 9
#define NVMNW_O_CMDDATA9                                            0x00000154

// Command Data Register 10
#define NVMNW_O_CMDDATA10                                           0x00000158

// Command Data Register 11
#define NVMNW_O_CMDDATA11                                           0x0000015C

// Command Data Register 12
#define NVMNW_O_CMDDATA12                                           0x00000160

// Command Data Register 13
#define NVMNW_O_CMDDATA13                                           0x00000164

// Command Data Register 14
#define NVMNW_O_CMDDATA14                                           0x00000168

// Command Data Register 15
#define NVMNW_O_CMDDATA15                                           0x0000016C

// Command Data Register 16
#define NVMNW_O_CMDDATA16                                           0x00000170

// Command Data Register 17
#define NVMNW_O_CMDDATA17                                           0x00000174

// Command Data Register 18
#define NVMNW_O_CMDDATA18                                           0x00000178

// Command Data Register 19
#define NVMNW_O_CMDDATA19                                           0x0000017C

// Command Data Register 20
#define NVMNW_O_CMDDATA20                                           0x00000180

// Command Data Register 21
#define NVMNW_O_CMDDATA21                                           0x00000184

// Command Data Register 22
#define NVMNW_O_CMDDATA22                                           0x00000188

// Command Data Register 23
#define NVMNW_O_CMDDATA23                                           0x0000018C

