espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Command Data Register 24
#define NVMNW_O_CMDDATA24                                           0x00000190

// Command Data Register 25
#define NVMNW_O_CMDDATA25                                           0x00000194

// Command Data Register 26
#define NVMNW_O_CMDDATA26                                           0x00000198

// Command Data Register 27
#define NVMNW_O_CMDDATA27                                           0x0000019C

// Command Data Register 28
#define NVMNW_O_CMDDATA28                                           0x000001A0

// Command Data Register 29
#define NVMNW_O_CMDDATA29                                           0x000001A4

// Command Data Register 30
#define NVMNW_O_CMDDATA30                                           0x000001A8

// Command Data Register 31
#define NVMNW_O_CMDDATA31                                           0x000001AC

// Command Data Register 0
#define NVMNW_O_CMDDATAECC0                                         0x000001B0

// Command Data Register 1
#define NVMNW_O_CMDDATAECC1                                         0x000001B4

// Command Data Register 2
#define NVMNW_O_CMDDATAECC2                                         0x000001B8

// Command Data Register 3
#define NVMNW_O_CMDDATAECC3                                         0x000001BC

// Command Data Register 4
#define NVMNW_O_CMDDATAECC4                                         0x000001C0

// Command Data Register 5
#define NVMNW_O_CMDDATAECC5                                         0x000001C4

// Command Data Register 6
#define NVMNW_O_CMDDATAECC6                                         0x000001C8

// Command Data Register 7
#define NVMNW_O_CMDDATAECC7                                         0x000001CC

// Command WriteErase Protect A Register
#define NVMNW_O_CMDWEPROTA                                          0x000001D0

// Command WriteErase Protect B Register
#define NVMNW_O_CMDWEPROTB                                          0x000001D4

// Command WriteErase Protect C Register
#define NVMNW_O_CMDWEPROTC                                          0x000001D8

// Command WriteErase Protect Non-Main
#define NVMNW_O_CMDWEPROTNM                                         0x00000210

// Command WriteErase Protect Trim
#define NVMNW_O_CMDWEPROTTR                                         0x00000214

// Command WriteErase Protect Engr
#define NVMNW_O_CMDWEPROTEN                                         0x00000218

// Command Configuration Register
#define NVMNW_O_CFGCMD                                              0x000003B0

// Pulse Counter Configuration Register
#define NVMNW_O_CFGPCNT                                             0x000003B4

// Command Status Register
#define NVMNW_O_STATCMD                                             0x000003D0

// Current Address Counter Value
#define NVMNW_O_STATADDR                                            0x000003D4

// Current Pulse Count Register:
#define NVMNW_O_STATPCNT                                            0x000003D8

// Mode Status Register
#define NVMNW_O_STATMODE                                            0x000003DC

// Global Info 0 Register
#define NVMNW_O_GBLINFO0                                            0x000003F0

// Global Info 1 Register
#define NVMNW_O_GBLINFO1                                            0x000003F4

// Bank Info 0 Register for bank 0.
#define NVMNW_O_BANK0INFO0                                          0x00000400

// Bank Info1 Register for bank 0.
#define NVMNW_O_BANK0INFO1                                          0x00000404

// Bank Info 0 Register for bank 1.
#define NVMNW_O_BANK1INFO0                                          0x00000410

// Bank Info1 Register for bank 1.
#define NVMNW_O_BANK1INFO1                                          0x00000414

// Bank Info 0 Register for bank 2.
#define NVMNW_O_BANK2INFO0                                          0x00000420

// Bank Info1 Register for bank 2.
#define NVMNW_O_BANK2INFO1                                          0x00000424

// Bank Info 0 Register for bank 3.
#define NVMNW_O_BANK3INFO0                                          0x00000430

// Bank Info1 Register for bank 3.
#define NVMNW_O_BANK3INFO1                                          0x00000434

// Bank Info 0 Register for bank 4.
#define NVMNW_O_BANK4INFO0                                          0x00000440

// Bank Info1 Register for bank 4.
#define NVMNW_O_BANK4INFO1                                          0x00000444

// DFT Enable Register
#define NVMNW_O_DFTEN                                               0x00000500

// DFT Command Control Register
#define NVMNW_O_DFTCMDCTL                                           0x00000504

// DFT Timer Control Register
#define NVMNW_O_DFTTIMERCTL                                         0x00000508

// DFT EXECUTEZ control register.  This register allows direct control of the
#define NVMNW_O_DFTEXECZCTL                                         0x0000050C

// DFT Pump Clock Test Control Register.  This register controls hardware
// features
#define NVMNW_O_DFTPCLKTESTCTL                                      0x00000510

// DFT Pump Clock Test Status Register.  This register shows status reported by
// the
#define NVMNW_O_DFTPCLKTESTSTAT                                     0x00000514

// DFT Redundancy Data Register 0
#define NVMNW_O_DFTDATARED0                                         0x00000540

// DFT Redundancy Data Register 1
#define NVMNW_O_DFTDATARED1                                         0x00000544

// DFT Redundancy Data Register 2
#define NVMNW_O_DFTDATARED2                                         0x00000548

// DFT Redundancy Data Register 3
#define NVMNW_O_DFTDATARED3                                         0x0000054C

// DFT Redundancy Data Register 4
#define NVMNW_O_DFTDATARED4                                         0x00000550

// DFT Redundancy Data Register 5
#define NVMNW_O_DFTDATARED5                                         0x00000554

// DFT Redundancy Data Register 6
#define NVMNW_O_DFTDATARED6                                         0x00000558

// DFT Redundancy Data Register 7
#define NVMNW_O_DFTDATARED7                                         0x0000055C

// DFT Pump Control Register
#define NVMNW_O_DFTPUMPCTL                                          0x00000560

// DFT Bank Control Register
#define NVMNW_O_DFTBANKCTL                                          0x00000564

// Allows control of the application of bank/pump trim values.
#define NVMNW_O_TRIMCTL                                             0x00000600

// Pump Trim 0 Register.
#define NVMNW_O_PUMPTRIM0                                           0x00000610

// Pump Trim 1 Register.
#define NVMNW_O_PUMPTRIM1                                           0x00000614

// Pump Trim 2 Register.
#define NVMNW_O_PUMPTRIM2                                           0x00000618

// Bank 0 Trim 0 Register.
#define NVMNW_O_BANK0TRIM0                                          0x00000630

// Bank 0 Trim 1 Register.
#define NVMNW_O_BANK0TRIM1                                          0x00000634

// Bank 1 Trim 0 Register.
#define NVMNW_O_BANK1TRIM0                                          0x00000640

// Bank 1 Trim 1 Register.
#define NVMNW_O_BANK1TRIM1                                          0x00000644

// Bank 2 Trim 0 Register.
#define NVMNW_O_BANK2TRIM0                                          0x00000650

// Bank 2 Trim 1 Register.
#define NVMNW_O_BANK2TRIM1                                          0x00000654

