espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Bank 3 Trim 0 Register.
#define NVMNW_O_BANK3TRIM0                                          0x00000660

// Bank 3 Trim 1 Register.
#define NVMNW_O_BANK3TRIM1                                          0x00000664

// Bank 4 Trim 0 Register.
#define NVMNW_O_BANK4TRIM0                                          0x00000670

// Bank 4 Trim 1 Register.
#define NVMNW_O_BANK4TRIM1                                          0x00000674

//*****************************************************************************
//
// Register: NVMNW_O_IIDX
//
//*****************************************************************************
// Field:     [0] STAT
//
// Indicates which interrupt has fired. 0x0 means no event pending. The
// priority order is fixed. On each read, only one interrupt is indicated. On a
// read, the current interrupt (highest priority) is automatically cleared by
// the hardware and the corresponding interrupt flags in the RIS and MIS are
// cleared as well. After a read from the CPU (not from the debug interface),
// the register must be updated with the next highest priority interrupt.
// ENUMs:
// DONE                     DONE Interrupt Pending
// NO_INTR                  No Interrupt Pending
#define NVMNW_IIDX_STAT                                             0x00000001
#define NVMNW_IIDX_STAT_BITN                                                 0
#define NVMNW_IIDX_STAT_M                                           0x00000001
#define NVMNW_IIDX_STAT_S                                                    0
#define NVMNW_IIDX_STAT_DONE                                        0x00000001
#define NVMNW_IIDX_STAT_NO_INTR                                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_IMASK
//
//*****************************************************************************
// Field:     [0] DONE
//
// Interrupt mask for DONE:
// 0: Interrupt is disabled in MIS register
// 1: Interrupt is enabled in MIS register
// ENUMs:
// ENABLED                  Interrupt will request an interrupt service
//                          routine and corresponding bit in IPSTANDARD.MIS
//                          will be set
// DISABLED                 Interrupt is masked out
#define NVMNW_IMASK_DONE                                            0x00000001
#define NVMNW_IMASK_DONE_BITN                                                0
#define NVMNW_IMASK_DONE_M                                          0x00000001
#define NVMNW_IMASK_DONE_S                                                   0
#define NVMNW_IMASK_DONE_ENABLED                                    0x00000001
#define NVMNW_IMASK_DONE_DISABLED                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_RIS
//
//*****************************************************************************
// Field:     [0] DONE
//
// NoWrapper operation completed.
// This interrupt bit is set by firmware or the corresponding bit in the ISET
// register.
// It is cleared by the corresponding bit in in the ICLR register or reading
// the IIDX register when this interrupt is the highest priority.
// ENUMs:
// SET                      Interrupt occurred
// CLR                      Interrupt did not occur
#define NVMNW_RIS_DONE                                              0x00000001
#define NVMNW_RIS_DONE_BITN                                                  0
#define NVMNW_RIS_DONE_M                                            0x00000001
#define NVMNW_RIS_DONE_S                                                     0
#define NVMNW_RIS_DONE_SET                                          0x00000001
#define NVMNW_RIS_DONE_CLR                                          0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_MIS
//
//*****************************************************************************
// Field:     [0] DONE
//
// NoWrapper operation completed.
// This masked interrupt bit reflects the bitwise AND of the corresponding RIS
// and IMASK bits.
// ENUMs:
// SET                      Masked interrupt occurred
// CLR                      Masked interrupt did not occur
#define NVMNW_MIS_DONE                                              0x00000001
#define NVMNW_MIS_DONE_BITN                                                  0
#define NVMNW_MIS_DONE_M                                            0x00000001
#define NVMNW_MIS_DONE_S                                                     0
#define NVMNW_MIS_DONE_SET                                          0x00000001
#define NVMNW_MIS_DONE_CLR                                          0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_ISET
//
//*****************************************************************************
// Field:     [0] DONE
//
// 0: No effect
// 1: Set the DONE interrupt in the RIS register
// ENUMs:
// SET                      Set IPSTANDARD.RIS bit
// NO_EFFECT                Writing a 0 has no effect
#define NVMNW_ISET_DONE                                             0x00000001
#define NVMNW_ISET_DONE_BITN                                                 0
#define NVMNW_ISET_DONE_M                                           0x00000001
#define NVMNW_ISET_DONE_S                                                    0
#define NVMNW_ISET_DONE_SET                                         0x00000001
#define NVMNW_ISET_DONE_NO_EFFECT                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_ICLR
//
//*****************************************************************************
// Field:     [0] DONE
//
// 0: No effect
// 1: Clear the DONE interrupt in the RIS register
// ENUMs:
// CLR                      Clear IPSTANDARD.RIS bit
// NO_EFFECT                Writing a 0 has no effect
#define NVMNW_ICLR_DONE                                             0x00000001
#define NVMNW_ICLR_DONE_BITN                                                 0
#define NVMNW_ICLR_DONE_M                                           0x00000001
#define NVMNW_ICLR_DONE_S                                                    0
#define NVMNW_ICLR_DONE_CLR                                         0x00000001
#define NVMNW_ICLR_DONE_NO_EFFECT                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_EVT_MODE
//
//*****************************************************************************
// Field:   [1:0] INT0_CFG
//
// Event line mode select for peripheral event
// ENUMs:
// HARDWARE                 The interrupt or event line is in hardware mode.
//                          Hardware should clear the RIS.
// SOFTWARE                 The interrupt or event line is in software mode.
//                          Software must clear the RIS.
// DISABLE                  The interrupt or event line is disabled.
#define NVMNW_EVT_MODE_INT0_CFG_W                                            2
#define NVMNW_EVT_MODE_INT0_CFG_M                                   0x00000003
#define NVMNW_EVT_MODE_INT0_CFG_S                                            0
#define NVMNW_EVT_MODE_INT0_CFG_HARDWARE                            0x00000002
#define NVMNW_EVT_MODE_INT0_CFG_SOFTWARE                            0x00000001
#define NVMNW_EVT_MODE_INT0_CFG_DISABLE                             0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DESC
//
//*****************************************************************************
// Field: [31:16] MODULEID
//
// Module ID
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define NVMNW_DESC_MODULEID_W                                               16
#define NVMNW_DESC_MODULEID_M                                       0xFFFF0000
#define NVMNW_DESC_MODULEID_S                                               16
#define NVMNW_DESC_MODULEID_MAXIMUM                                 0xFFFF0000
#define NVMNW_DESC_MODULEID_MINIMUM                                 0x00000000

