espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field: [15:12] FEATUREVER
//
// Feature set
// ENUMs:
// MAXIMUM                  Maximum Value
// MINIMUM                  Minimum Value
#define NVMNW_DESC_FEATUREVER_W                                              4
#define NVMNW_DESC_FEATUREVER_M                                     0x0000F000
#define NVMNW_DESC_FEATUREVER_S                                             12
#define NVMNW_DESC_FEATUREVER_MAXIMUM                               0x0000F000
#define NVMNW_DESC_FEATUREVER_MINIMUM                               0x00000000

// Field:  [11:8] INSTNUM
//
// Instance number
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define NVMNW_DESC_INSTNUM_W                                                 4
#define NVMNW_DESC_INSTNUM_M                                        0x00000F00
#define NVMNW_DESC_INSTNUM_S                                                 8
#define NVMNW_DESC_INSTNUM_MAXIMUM                                  0x00000F00
#define NVMNW_DESC_INSTNUM_MINIMUM                                  0x00000000

// Field:   [7:4] MAJREV
//
// Major Revision
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define NVMNW_DESC_MAJREV_W                                                  4
#define NVMNW_DESC_MAJREV_M                                         0x000000F0
#define NVMNW_DESC_MAJREV_S                                                  4
#define NVMNW_DESC_MAJREV_MAXIMUM                                   0x000000F0
#define NVMNW_DESC_MAJREV_MINIMUM                                   0x00000000

// Field:   [3:0] MINREV
//
// Minor Revision
// ENUMs:
// MAXIMUM                  Highest possible value
// MINIMUM                  Smallest value
#define NVMNW_DESC_MINREV_W                                                  4
#define NVMNW_DESC_MINREV_M                                         0x0000000F
#define NVMNW_DESC_MINREV_S                                                  0
#define NVMNW_DESC_MINREV_MAXIMUM                                   0x0000000F
#define NVMNW_DESC_MINREV_MINIMUM                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDEXEC
//
//*****************************************************************************
// Field:     [0] VAL
//
// Flash Wrapper State Machine Command Execute
// Initiates execution of the command specified in the FW_SMCMD_TYPE register.
// ENUMs:
// EXECUTE                  Command will execute or is executing in NoWrapper
// NOEXECUTE                Command will not execute or is not executing in
//                          NoWrapper
#define NVMNW_CMDEXEC_VAL                                           0x00000001
#define NVMNW_CMDEXEC_VAL_BITN                                               0
#define NVMNW_CMDEXEC_VAL_M                                         0x00000001
#define NVMNW_CMDEXEC_VAL_S                                                  0
#define NVMNW_CMDEXEC_VAL_EXECUTE                                   0x00000001
#define NVMNW_CMDEXEC_VAL_NOEXECUTE                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDTYPE
//
//*****************************************************************************
// Field:   [6:4] SIZE
//
// Command size
// ENUMs:
// BANK                     Operate on an entire flash bank
// SECTOR                   Operate on a flash sector
// EIGHTWORD                Operate on 8 flash words
// FOURWORD                 Operate on 4 flash words
// TWOWORD                  Operate on 2 flash words
// ONEWORD                  Operate on 1 flash word
#define NVMNW_CMDTYPE_SIZE_W                                                 3
#define NVMNW_CMDTYPE_SIZE_M                                        0x00000070
#define NVMNW_CMDTYPE_SIZE_S                                                 4
#define NVMNW_CMDTYPE_SIZE_BANK                                     0x00000050
#define NVMNW_CMDTYPE_SIZE_SECTOR                                   0x00000040
#define NVMNW_CMDTYPE_SIZE_EIGHTWORD                                0x00000030
#define NVMNW_CMDTYPE_SIZE_FOURWORD                                 0x00000020
#define NVMNW_CMDTYPE_SIZE_TWOWORD                                  0x00000010
#define NVMNW_CMDTYPE_SIZE_ONEWORD                                  0x00000000

// Field:   [2:0] COMMAND
//
// Command type
// ENUMs:
// CLEARSTATUS              Clear Status - Clear status bits in FW_SMSTAT
//                          only.
// MODECHANGE               Mode Change - Perform a mode change only, no other
//                          operation.
// READVERIFY               Read Verify - Perform a standalone read verify
//                          operation.
// ERASE                    Erase
// PROGRAM                  Program
// NOOP                     No Operation
#define NVMNW_CMDTYPE_COMMAND_W                                              3
#define NVMNW_CMDTYPE_COMMAND_M                                     0x00000007
#define NVMNW_CMDTYPE_COMMAND_S                                              0
#define NVMNW_CMDTYPE_COMMAND_CLEARSTATUS                           0x00000005
#define NVMNW_CMDTYPE_COMMAND_MODECHANGE                            0x00000004
#define NVMNW_CMDTYPE_COMMAND_READVERIFY                            0x00000003
#define NVMNW_CMDTYPE_COMMAND_ERASE                                 0x00000002
#define NVMNW_CMDTYPE_COMMAND_PROGRAM                               0x00000001
#define NVMNW_CMDTYPE_COMMAND_NOOP                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDCTL
//
//*****************************************************************************
// Field:    [21] DATAVEREN
//
// Enable invalid data verify.  This checks for 0->1 transitions in the memory
// when
// a program operation is initiated.  If such a transition is found, the
// program will
// fail with an error without doing any programming.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_CMDCTL_DATAVEREN                                      0x00200000
#define NVMNW_CMDCTL_DATAVEREN_BITN                                         21
#define NVMNW_CMDCTL_DATAVEREN_M                                    0x00200000
#define NVMNW_CMDCTL_DATAVEREN_S                                            21
#define NVMNW_CMDCTL_DATAVEREN_ENABLE                               0x00200000
#define NVMNW_CMDCTL_DATAVEREN_DISABLE                              0x00000000

// Field:    [20] SSERASEDIS
//
// Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will
// be used
// for all erase pulses.
// By default, this bit is reset, meaning that the VHV voltage will be stepped
// during
// successive erase pulses.  The step count, step voltage, begin and end
// voltages
// are all hard-wired.
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_CMDCTL_SSERASEDIS                                     0x00100000
#define NVMNW_CMDCTL_SSERASEDIS_BITN                                        20
#define NVMNW_CMDCTL_SSERASEDIS_M                                   0x00100000
#define NVMNW_CMDCTL_SSERASEDIS_S                                           20
#define NVMNW_CMDCTL_SSERASEDIS_DISABLE                             0x00100000
#define NVMNW_CMDCTL_SSERASEDIS_ENABLE                              0x00000000

// Field:    [19] ERASEMASKDIS
//
// Disable use of erase mask for erase
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_CMDCTL_ERASEMASKDIS                                   0x00080000
#define NVMNW_CMDCTL_ERASEMASKDIS_BITN                                      19
#define NVMNW_CMDCTL_ERASEMASKDIS_M                                 0x00080000
#define NVMNW_CMDCTL_ERASEMASKDIS_S                                         19
#define NVMNW_CMDCTL_ERASEMASKDIS_DISABLE                           0x00080000
#define NVMNW_CMDCTL_ERASEMASKDIS_ENABLE                            0x00000000

// Field:    [18] PROGMASKDIS
//
// Disable use of program mask for programming
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_CMDCTL_PROGMASKDIS                                    0x00040000
#define NVMNW_CMDCTL_PROGMASKDIS_BITN                                       18
#define NVMNW_CMDCTL_PROGMASKDIS_M                                  0x00040000
#define NVMNW_CMDCTL_PROGMASKDIS_S                                          18
#define NVMNW_CMDCTL_PROGMASKDIS_DISABLE                            0x00040000
#define NVMNW_CMDCTL_PROGMASKDIS_ENABLE                             0x00000000

// Field:    [17] ECCGENOVR
//
// Override hardware generation of ECC data for program.  Use data written to
// FWSM_DATA_ECC.
// ENUMs:
// OVERRIDE                 Override
// NOOVERRIDE               Do not override
#define NVMNW_CMDCTL_ECCGENOVR                                      0x00020000
#define NVMNW_CMDCTL_ECCGENOVR_BITN                                         17
#define NVMNW_CMDCTL_ECCGENOVR_M                                    0x00020000
#define NVMNW_CMDCTL_ECCGENOVR_S                                            17
#define NVMNW_CMDCTL_ECCGENOVR_OVERRIDE                             0x00020000
#define NVMNW_CMDCTL_ECCGENOVR_NOOVERRIDE                           0x00000000

// Field:    [16] ADDRXLATEOVR
//
// Override hardware address translation of address in CMDADDR from a
// system address to a bank address and bank ID.  Use data written to
// CMDADDR directly as the bank address.  Use the value written to
// CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
// CMDCTL.REGIONSEL directly as the region ID.
// ENUMs:
// OVERRIDE                 Override
// NOOVERRIDE               Do not override
#define NVMNW_CMDCTL_ADDRXLATEOVR                                   0x00010000
#define NVMNW_CMDCTL_ADDRXLATEOVR_BITN                                      16
#define NVMNW_CMDCTL_ADDRXLATEOVR_M                                 0x00010000
#define NVMNW_CMDCTL_ADDRXLATEOVR_S                                         16
#define NVMNW_CMDCTL_ADDRXLATEOVR_OVERRIDE                          0x00010000
#define NVMNW_CMDCTL_ADDRXLATEOVR_NOOVERRIDE                        0x00000000

// Field:    [15] POSTVEREN
//
// Enable verify after program or erase
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_CMDCTL_POSTVEREN                                      0x00008000
#define NVMNW_CMDCTL_POSTVEREN_BITN                                         15
#define NVMNW_CMDCTL_POSTVEREN_M                                    0x00008000
#define NVMNW_CMDCTL_POSTVEREN_S                                            15
#define NVMNW_CMDCTL_POSTVEREN_ENABLE                               0x00008000
#define NVMNW_CMDCTL_POSTVEREN_DISABLE                              0x00000000

// Field:    [14] PREVEREN
//
// Enable verify before program or erase.  For program, bits already
// programmed
// to the requested value will be masked.  For erase, sectors already erased
// will be
// masked.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_CMDCTL_PREVEREN                                       0x00004000
#define NVMNW_CMDCTL_PREVEREN_BITN                                          14
#define NVMNW_CMDCTL_PREVEREN_M                                     0x00004000
#define NVMNW_CMDCTL_PREVEREN_S                                             14
#define NVMNW_CMDCTL_PREVEREN_ENABLE                                0x00004000
#define NVMNW_CMDCTL_PREVEREN_DISABLE                               0x00000000

// Field:  [12:9] REGIONSEL
//
// Bank Region
// ENUMs:
// ENGR                     Engr Region
// TRIM                     Trim Region
// NONMAIN                  Non-Main Region
// MAIN                     Main Region
#define NVMNW_CMDCTL_REGIONSEL_W                                             4
#define NVMNW_CMDCTL_REGIONSEL_M                                    0x00001E00
#define NVMNW_CMDCTL_REGIONSEL_S                                             9
#define NVMNW_CMDCTL_REGIONSEL_ENGR                                 0x00001000
#define NVMNW_CMDCTL_REGIONSEL_TRIM                                 0x00000800
#define NVMNW_CMDCTL_REGIONSEL_NONMAIN                              0x00000400
#define NVMNW_CMDCTL_REGIONSEL_MAIN                                 0x00000200

