espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:     [4] BANKSEL
//
// Bank Select
// ENUMs:
// BANK4                    Bank 4
// BANK3                    Bank 3
// BANK2                    Bank 2
// BANK1                    Bank 1
// BANK0                    Bank 0
#define NVMNW_CMDCTL_BANKSEL                                        0x00000010
#define NVMNW_CMDCTL_BANKSEL_BITN                                            4
#define NVMNW_CMDCTL_BANKSEL_M                                      0x00000010
#define NVMNW_CMDCTL_BANKSEL_S                                               4
#define NVMNW_CMDCTL_BANKSEL_BANK4                                  0x00000100
#define NVMNW_CMDCTL_BANKSEL_BANK3                                  0x00000080
#define NVMNW_CMDCTL_BANKSEL_BANK2                                  0x00000040
#define NVMNW_CMDCTL_BANKSEL_BANK1                                  0x00000020
#define NVMNW_CMDCTL_BANKSEL_BANK0                                  0x00000010

// Field:   [3:0] MODESEL
//
// Mode
// This field is only used for the Mode Change command type.  Otherwise, bank
// and pump modes are set automaticlly via the NW hardware.
// ENUMs:
// ERASEBNK                 Erase Bank
// PGMMW                    Program Multiple Word
// LEAKVER                  Leakage Verify Mode
// ERASESECT                Erase Sector
// ERASEVER                 Erase Verify Mode
// PGMSW                    Program Single Word
// PGMVER                   Program Verify Mode
// NOOP                     No Operation
// RDMARG1B                 Read Margin 1B Mode
// RDMARG0B                 Read Margin 0B Mode
// RDMARG1                  Read Margin 1 Mode
// RDMARG0                  Read Margin 0 Mode
// READ                     Read Mode
#define NVMNW_CMDCTL_MODESEL_W                                               4
#define NVMNW_CMDCTL_MODESEL_M                                      0x0000000F
#define NVMNW_CMDCTL_MODESEL_S                                               0
#define NVMNW_CMDCTL_MODESEL_ERASEBNK                               0x0000000F
#define NVMNW_CMDCTL_MODESEL_PGMMW                                  0x0000000E
#define NVMNW_CMDCTL_MODESEL_LEAKVER                                0x0000000D
#define NVMNW_CMDCTL_MODESEL_ERASESECT                              0x0000000C
#define NVMNW_CMDCTL_MODESEL_ERASEVER                               0x0000000B
#define NVMNW_CMDCTL_MODESEL_PGMSW                                  0x0000000A
#define NVMNW_CMDCTL_MODESEL_PGMVER                                 0x00000009
#define NVMNW_CMDCTL_MODESEL_NOOP                                   0x00000008
#define NVMNW_CMDCTL_MODESEL_RDMARG1B                               0x00000007
#define NVMNW_CMDCTL_MODESEL_RDMARG0B                               0x00000006
#define NVMNW_CMDCTL_MODESEL_RDMARG1                                0x00000004
#define NVMNW_CMDCTL_MODESEL_RDMARG0                                0x00000002
#define NVMNW_CMDCTL_MODESEL_READ                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDADDR
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Flash Wrapper State Machine Command Address
// A 32-bit system address is placed in this register.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDADDR_VAL_W                                                 32
#define NVMNW_CMDADDR_VAL_M                                         0xFFFFFFFF
#define NVMNW_CMDADDR_VAL_S                                                  0
#define NVMNW_CMDADDR_VAL_MAXIMUM                                   0xFFFFFFFF
#define NVMNW_CMDADDR_VAL_MINIMUM                                   0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDBYTEN
//
//*****************************************************************************
// Field:   [7:0] VAL
//
// Flash Wrapper State Machine Command Program Mask
// A 1-bit per flash word byte value is placed in this register.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDBYTEN_VAL_W                                                 8
#define NVMNW_CMDBYTEN_VAL_M                                        0x000000FF
#define NVMNW_CMDBYTEN_VAL_S                                                 0
#define NVMNW_CMDBYTEN_VAL_MAXIMUM                                  0x0003FFFF
#define NVMNW_CMDBYTEN_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAINDEX
//
//*****************************************************************************
// Field:   [2:0] VAL
//
// Data register index
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATAINDEX_VAL_W                                             3
#define NVMNW_CMDDATAINDEX_VAL_M                                    0x00000007
#define NVMNW_CMDDATAINDEX_VAL_S                                             0
#define NVMNW_CMDDATAINDEX_VAL_MAXIMUM                              0x00000007
#define NVMNW_CMDDATAINDEX_VAL_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA0_VAL_W                                                32
#define NVMNW_CMDDATA0_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA0_VAL_S                                                 0
#define NVMNW_CMDDATA0_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA0_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA1_VAL_W                                                32
#define NVMNW_CMDDATA1_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA1_VAL_S                                                 0
#define NVMNW_CMDDATA1_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA1_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA2
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA2_VAL_W                                                32
#define NVMNW_CMDDATA2_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA2_VAL_S                                                 0
#define NVMNW_CMDDATA2_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA2_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA3
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA3_VAL_W                                                32
#define NVMNW_CMDDATA3_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA3_VAL_S                                                 0
#define NVMNW_CMDDATA3_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA3_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA4
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA4_VAL_W                                                32
#define NVMNW_CMDDATA4_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA4_VAL_S                                                 0
#define NVMNW_CMDDATA4_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA4_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA5
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA5_VAL_W                                                32
#define NVMNW_CMDDATA5_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA5_VAL_S                                                 0
#define NVMNW_CMDDATA5_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA5_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA6
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA6_VAL_W                                                32
#define NVMNW_CMDDATA6_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA6_VAL_S                                                 0
#define NVMNW_CMDDATA6_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA6_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA7
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA7_VAL_W                                                32
#define NVMNW_CMDDATA7_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA7_VAL_S                                                 0
#define NVMNW_CMDDATA7_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA7_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA8
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA8_VAL_W                                                32
#define NVMNW_CMDDATA8_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA8_VAL_S                                                 0
#define NVMNW_CMDDATA8_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA8_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA9
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA9_VAL_W                                                32
#define NVMNW_CMDDATA9_VAL_M                                        0xFFFFFFFF
#define NVMNW_CMDDATA9_VAL_S                                                 0
#define NVMNW_CMDDATA9_VAL_MAXIMUM                                  0xFFFFFFFF
#define NVMNW_CMDDATA9_VAL_MINIMUM                                  0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA10
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA10_VAL_W                                               32
#define NVMNW_CMDDATA10_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA10_VAL_S                                                0
#define NVMNW_CMDDATA10_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA10_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA11
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA11_VAL_W                                               32
#define NVMNW_CMDDATA11_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA11_VAL_S                                                0
#define NVMNW_CMDDATA11_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA11_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA12
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA12_VAL_W                                               32
#define NVMNW_CMDDATA12_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA12_VAL_S                                                0
#define NVMNW_CMDDATA12_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA12_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA13
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA13_VAL_W                                               32
#define NVMNW_CMDDATA13_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA13_VAL_S                                                0
#define NVMNW_CMDDATA13_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA13_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA14
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA14_VAL_W                                               32
#define NVMNW_CMDDATA14_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA14_VAL_S                                                0
#define NVMNW_CMDDATA14_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA14_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA15
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA15_VAL_W                                               32
#define NVMNW_CMDDATA15_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA15_VAL_S                                                0
#define NVMNW_CMDDATA15_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA15_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA16
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA16_VAL_W                                               32
#define NVMNW_CMDDATA16_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA16_VAL_S                                                0
#define NVMNW_CMDDATA16_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA16_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA17
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA17_VAL_W                                               32
#define NVMNW_CMDDATA17_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA17_VAL_S                                                0
#define NVMNW_CMDDATA17_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA17_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA18
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA18_VAL_W                                               32
#define NVMNW_CMDDATA18_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA18_VAL_S                                                0
#define NVMNW_CMDDATA18_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA18_VAL_MINIMUM                                 0x00000000

