espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA19
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA19_VAL_W                                               32
#define NVMNW_CMDDATA19_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA19_VAL_S                                                0
#define NVMNW_CMDDATA19_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA19_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA20
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA20_VAL_W                                               32
#define NVMNW_CMDDATA20_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA20_VAL_S                                                0
#define NVMNW_CMDDATA20_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA20_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA21
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA21_VAL_W                                               32
#define NVMNW_CMDDATA21_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA21_VAL_S                                                0
#define NVMNW_CMDDATA21_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA21_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA22
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA22_VAL_W                                               32
#define NVMNW_CMDDATA22_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA22_VAL_S                                                0
#define NVMNW_CMDDATA22_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA22_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA23
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA23_VAL_W                                               32
#define NVMNW_CMDDATA23_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA23_VAL_S                                                0
#define NVMNW_CMDDATA23_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA23_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA24
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA24_VAL_W                                               32
#define NVMNW_CMDDATA24_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA24_VAL_S                                                0
#define NVMNW_CMDDATA24_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA24_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA25
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA25_VAL_W                                               32
#define NVMNW_CMDDATA25_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA25_VAL_S                                                0
#define NVMNW_CMDDATA25_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA25_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA26
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA26_VAL_W                                               32
#define NVMNW_CMDDATA26_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA26_VAL_S                                                0
#define NVMNW_CMDDATA26_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA26_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA27
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA27_VAL_W                                               32
#define NVMNW_CMDDATA27_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA27_VAL_S                                                0
#define NVMNW_CMDDATA27_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA27_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA28
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA28_VAL_W                                               32
#define NVMNW_CMDDATA28_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA28_VAL_S                                                0
#define NVMNW_CMDDATA28_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA28_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA29
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA29_VAL_W                                               32
#define NVMNW_CMDDATA29_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA29_VAL_S                                                0
#define NVMNW_CMDDATA29_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA29_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA30
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA30_VAL_W                                               32
#define NVMNW_CMDDATA30_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA30_VAL_S                                                0
#define NVMNW_CMDDATA30_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA30_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATA31
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// A 32-bit data value is placed in this field.
// This field is blocked for writes after being written to 1 and prior to
// FW_SMCMT_STAT.DONE being set by the NoWrapper hardware.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDDATA31_VAL_W                                               32
#define NVMNW_CMDDATA31_VAL_M                                       0xFFFFFFFF
#define NVMNW_CMDDATA31_VAL_S                                                0
#define NVMNW_CMDDATA31_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_CMDDATA31_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC0
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC0_VAL1_W                                             8
#define NVMNW_CMDDATAECC0_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC0_VAL1_S                                             8
#define NVMNW_CMDDATAECC0_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC0_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC0_VAL0_W                                             8
#define NVMNW_CMDDATAECC0_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC0_VAL0_S                                             0
#define NVMNW_CMDDATAECC0_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC0_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC1
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC1_VAL1_W                                             8
#define NVMNW_CMDDATAECC1_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC1_VAL1_S                                             8
#define NVMNW_CMDDATAECC1_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC1_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC1_VAL0_W                                             8
#define NVMNW_CMDDATAECC1_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC1_VAL0_S                                             0
#define NVMNW_CMDDATAECC1_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC1_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC2
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC2_VAL1_W                                             8
#define NVMNW_CMDDATAECC2_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC2_VAL1_S                                             8
#define NVMNW_CMDDATAECC2_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC2_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC2_VAL0_W                                             8
#define NVMNW_CMDDATAECC2_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC2_VAL0_S                                             0
#define NVMNW_CMDDATAECC2_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC2_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC3
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC3_VAL1_W                                             8
#define NVMNW_CMDDATAECC3_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC3_VAL1_S                                             8
#define NVMNW_CMDDATAECC3_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC3_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC3_VAL0_W                                             8
#define NVMNW_CMDDATAECC3_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC3_VAL0_S                                             0
#define NVMNW_CMDDATAECC3_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC3_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC4
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC4_VAL1_W                                             8
#define NVMNW_CMDDATAECC4_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC4_VAL1_S                                             8
#define NVMNW_CMDDATAECC4_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC4_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC4_VAL0_W                                             8
#define NVMNW_CMDDATAECC4_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC4_VAL0_S                                             0
#define NVMNW_CMDDATAECC4_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC4_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC5
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC5_VAL1_W                                             8
#define NVMNW_CMDDATAECC5_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC5_VAL1_S                                             8
#define NVMNW_CMDDATAECC5_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC5_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC5_VAL0_W                                             8
#define NVMNW_CMDDATAECC5_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC5_VAL0_S                                             0
#define NVMNW_CMDDATAECC5_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC5_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC6
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC6_VAL1_W                                             8
#define NVMNW_CMDDATAECC6_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC6_VAL1_S                                             8
#define NVMNW_CMDDATAECC6_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC6_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC6_VAL0_W                                             8
#define NVMNW_CMDDATAECC6_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC6_VAL0_S                                             0
#define NVMNW_CMDDATAECC6_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC6_VAL0_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDDATAECC7
//
//*****************************************************************************
// Field:  [15:8] VAL1
//
// ECC data for bits 127:64 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC7_VAL1_W                                             8
#define NVMNW_CMDDATAECC7_VAL1_M                                    0x0000FF00
#define NVMNW_CMDDATAECC7_VAL1_S                                             8
#define NVMNW_CMDDATAECC7_VAL1_MAXIMUM                              0x0000FF00
#define NVMNW_CMDDATAECC7_VAL1_MINIMUM                              0x00000000

// Field:   [7:0] VAL0
//
// ECC data for bits 63:0 of the data is placed here.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CMDDATAECC7_VAL0_W                                             8
#define NVMNW_CMDDATAECC7_VAL0_M                                    0x000000FF
#define NVMNW_CMDDATAECC7_VAL0_S                                             0
#define NVMNW_CMDDATAECC7_VAL0_MAXIMUM                              0x000000FF
#define NVMNW_CMDDATAECC7_VAL0_MINIMUM                              0x00000000

