espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTA
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects 1 sector.
//
// bit [0]:	When 1, sector 0 of the flash memory will be protected from
// program
// 		and erase.
// bit [1]:	When 1, sector 1 of the flash memory will be protected from
// program
// 		and erase.
// 	:
// 	:
// bit [31]:	When 1, sector 31 of the flash memory will be protected from
// program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTA_VAL_W                                              32
#define NVMNW_CMDWEPROTA_VAL_M                                      0xFFFFFFFF
#define NVMNW_CMDWEPROTA_VAL_S                                               0
#define NVMNW_CMDWEPROTA_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_CMDWEPROTA_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTB
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects a group of 8 sectors.
//
// bit [0]:	When 1, sectors 0-7 of the flash memory will be protected from
// program
// 		and erase.
// bit [1]:	When 1, sectors 8-15 of the flash memory will be protected from
// program
// 		and erase.
// 	:
// 	:
// bit [31]:	When 1, sectors 248-255 of the flash memory will be protected from
// program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTB_VAL_W                                              32
#define NVMNW_CMDWEPROTB_VAL_M                                      0xFFFFFFFF
#define NVMNW_CMDWEPROTB_VAL_S                                               0
#define NVMNW_CMDWEPROTB_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_CMDWEPROTB_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTC
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects a group of 8 sectors.
//
// bit [0]:	When 1, sectors 256-263 of the main region will be protected from
// program
// 		and erase.
// bit [1]:	When 1, sectors 264-271 of the main region will be protected from
// program
// 		and erase.
// 	:
// 	:
// bit [31]:	When 1, sectors 504-511 of the main region will be protected from
// program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTC_VAL_W                                              32
#define NVMNW_CMDWEPROTC_VAL_M                                      0xFFFFFFFF
#define NVMNW_CMDWEPROTC_VAL_S                                               0
#define NVMNW_CMDWEPROTC_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_CMDWEPROTC_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTNM
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects 1 sector.
//
// bit [0]:	When 1, sector 0 of the non-main region will be protected from
// program
// 		and erase.
// bit [1]:	When 1, sector 1 of the non-main region will be protected from
// program
// 		and erase.
// 	:
// 	:
// bit [16]:	When 1, sector 15 of the non-main will be protected from program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTNM_VAL_W                                             32
#define NVMNW_CMDWEPROTNM_VAL_M                                     0xFFFFFFFF
#define NVMNW_CMDWEPROTNM_VAL_S                                              0
#define NVMNW_CMDWEPROTNM_VAL_MAXIMUM                               0xFFFFFFFF
#define NVMNW_CMDWEPROTNM_VAL_MINIMUM                               0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTTR
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects 1 sector.
//
// bit [0]:	When 1, sector 0 of the engr region will be protected from program
// 		and erase.
// bit [1]:	When 1, sector 1 of the engr region will be protected from program
// 		and erase.
// 	:
// 	:
// bit [16]:	When 1, sector 15 of the engr region will be protected from
// program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTTR_VAL_W                                             32
#define NVMNW_CMDWEPROTTR_VAL_M                                     0xFFFFFFFF
#define NVMNW_CMDWEPROTTR_VAL_S                                              0
#define NVMNW_CMDWEPROTTR_VAL_MAXIMUM                               0xFFFFFFFF
#define NVMNW_CMDWEPROTTR_VAL_MINIMUM                               0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CMDWEPROTEN
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Each bit protects 1 sector.
//
// bit [0]:	When 1, sector 0 of the engr region will be protected from program
// 		and erase.
// bit [1]:	When 1, sector 1 of the engr region will be protected from program
// 		and erase.
// 	:
// 	:
// bit [16]:	When 1, sector 15 of the engr region will be protected from
// program
// 		and erase.
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_CMDWEPROTEN_VAL_W                                             32
#define NVMNW_CMDWEPROTEN_VAL_M                                     0xFFFFFFFF
#define NVMNW_CMDWEPROTEN_VAL_S                                              0
#define NVMNW_CMDWEPROTEN_VAL_MAXIMUM                               0xFFFFFFFF
#define NVMNW_CMDWEPROTEN_VAL_MINIMUM                               0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CFGCMD
//
//*****************************************************************************
// Field:   [3:0] WAITSTATE
//
// Wait State setting for read verify
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CFGCMD_WAITSTATE_W                                             4
#define NVMNW_CFGCMD_WAITSTATE_M                                    0x0000000F
#define NVMNW_CFGCMD_WAITSTATE_S                                             0
#define NVMNW_CFGCMD_WAITSTATE_MAXIMUM                              0x0000000F
#define NVMNW_CFGCMD_WAITSTATE_MINIMUM                              0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_CFGPCNT
//
//*****************************************************************************
// Field:  [11:4] MAXPCNTVAL
//
// Override maximum pulse counter with this value.  Full max value will be
// {4'h0, MAXPCNTVAL}
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_CFGPCNT_MAXPCNTVAL_W                                           8
#define NVMNW_CFGPCNT_MAXPCNTVAL_M                                  0x00000FF0
#define NVMNW_CFGPCNT_MAXPCNTVAL_S                                           4
#define NVMNW_CFGPCNT_MAXPCNTVAL_MAXIMUM                            0x00000FF0
#define NVMNW_CFGPCNT_MAXPCNTVAL_MINIMUM                            0x00000000

// Field:     [0] MAXPCNTOVR
//
// Override hard-wired maximum pulse count for program or erase
// Enumeration:
// 0: Use hard-wired (default) maximum pulse count
// 1: Use value from MAX_PCNT field as maximum pulse count
// ENUMs:
// OVERRIDE                 Use value from MAX_PCNT_OVR field as maximum puse
//                          count
// DEFAULT                  Use hard-wired (default) value for maximum pulse
//                          count
#define NVMNW_CFGPCNT_MAXPCNTOVR                                    0x00000001
#define NVMNW_CFGPCNT_MAXPCNTOVR_BITN                                        0
#define NVMNW_CFGPCNT_MAXPCNTOVR_M                                  0x00000001
#define NVMNW_CFGPCNT_MAXPCNTOVR_S                                           0
#define NVMNW_CFGPCNT_MAXPCNTOVR_OVERRIDE                           0x00000001
#define NVMNW_CFGPCNT_MAXPCNTOVR_DEFAULT                            0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_STATCMD
//
//*****************************************************************************
// Field:    [12] FAILMISC
//
// Command failed due to error other than write/erase protect violation or
// verify
// error.  This is an extra bit in case a new failure mechanism is added which
// requires a status bit.
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILMISC                                      0x00001000
#define NVMNW_STATCMD_FAILMISC_BITN                                         12
#define NVMNW_STATCMD_FAILMISC_M                                    0x00001000
#define NVMNW_STATCMD_FAILMISC_S                                            12
#define NVMNW_STATCMD_FAILMISC_STATFAIL                             0x00001000
#define NVMNW_STATCMD_FAILMISC_STATNOFAIL                           0x00000000

// Field:     [8] FAILINVDATA
//
// Program command failed because an attempt was made to program a stored
// 0 value to a 1.
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILINVDATA                                   0x00000100
#define NVMNW_STATCMD_FAILINVDATA_BITN                                       8
#define NVMNW_STATCMD_FAILINVDATA_M                                 0x00000100
#define NVMNW_STATCMD_FAILINVDATA_S                                          8
#define NVMNW_STATCMD_FAILINVDATA_STATFAIL                          0x00000100
#define NVMNW_STATCMD_FAILINVDATA_STATNOFAIL                        0x00000000

// Field:     [7] FAILMODE
//
// Command failed because a bank has been set to a mode other than READ.
// Program and Erase commands cannot be initiated unless all banks are in READ
// mode.
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILMODE                                      0x00000080
#define NVMNW_STATCMD_FAILMODE_BITN                                          7
#define NVMNW_STATCMD_FAILMODE_M                                    0x00000080
#define NVMNW_STATCMD_FAILMODE_S                                             7
#define NVMNW_STATCMD_FAILMODE_STATFAIL                             0x00000080
#define NVMNW_STATCMD_FAILMODE_STATNOFAIL                           0x00000000

// Field:     [6] FAILILLADDR
//
// Command failed due to the use of an illegal address
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILILLADDR                                   0x00000040
#define NVMNW_STATCMD_FAILILLADDR_BITN                                       6
#define NVMNW_STATCMD_FAILILLADDR_M                                 0x00000040
#define NVMNW_STATCMD_FAILILLADDR_S                                          6
#define NVMNW_STATCMD_FAILILLADDR_STATFAIL                          0x00000040
#define NVMNW_STATCMD_FAILILLADDR_STATNOFAIL                        0x00000000

// Field:     [5] FAILVERIFY
//
// Command failed due to verify error
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILVERIFY                                    0x00000020
#define NVMNW_STATCMD_FAILVERIFY_BITN                                        5
#define NVMNW_STATCMD_FAILVERIFY_M                                  0x00000020
#define NVMNW_STATCMD_FAILVERIFY_S                                           5
#define NVMNW_STATCMD_FAILVERIFY_STATFAIL                           0x00000020
#define NVMNW_STATCMD_FAILVERIFY_STATNOFAIL                         0x00000000

// Field:     [4] FAILWEPROT
//
// Command failed due to Write/Erase Protect Sector Violation
// ENUMs:
// STATFAIL                 Fail
// STATNOFAIL               No Fail
#define NVMNW_STATCMD_FAILWEPROT                                    0x00000010
#define NVMNW_STATCMD_FAILWEPROT_BITN                                        4
#define NVMNW_STATCMD_FAILWEPROT_M                                  0x00000010
#define NVMNW_STATCMD_FAILWEPROT_S                                           4
#define NVMNW_STATCMD_FAILWEPROT_STATFAIL                           0x00000010
#define NVMNW_STATCMD_FAILWEPROT_STATNOFAIL                         0x00000000

