espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:     [2] CMDINPROGRESS
//
// Command In Progress
// ENUMs:
// STATINPROGRESS           In Progress
// STATCOMPLETE             Complete
#define NVMNW_STATCMD_CMDINPROGRESS                                 0x00000004
#define NVMNW_STATCMD_CMDINPROGRESS_BITN                                     2
#define NVMNW_STATCMD_CMDINPROGRESS_M                               0x00000004
#define NVMNW_STATCMD_CMDINPROGRESS_S                                        2
#define NVMNW_STATCMD_CMDINPROGRESS_STATINPROGRESS                  0x00000004
#define NVMNW_STATCMD_CMDINPROGRESS_STATCOMPLETE                    0x00000000

// Field:     [1] CMDPASS
//
// Command Pass - valid when CMD_DONE field is 1
// ENUMs:
// STATPASS                 Pass
// STATFAIL                 Fail
#define NVMNW_STATCMD_CMDPASS                                       0x00000002
#define NVMNW_STATCMD_CMDPASS_BITN                                           1
#define NVMNW_STATCMD_CMDPASS_M                                     0x00000002
#define NVMNW_STATCMD_CMDPASS_S                                              1
#define NVMNW_STATCMD_CMDPASS_STATPASS                              0x00000002
#define NVMNW_STATCMD_CMDPASS_STATFAIL                              0x00000000

// Field:     [0] CMDDONE
//
// Command Done
// ENUMs:
// STATDONE                 Done
// STATNOTDONE              Not Done
#define NVMNW_STATCMD_CMDDONE                                       0x00000001
#define NVMNW_STATCMD_CMDDONE_BITN                                           0
#define NVMNW_STATCMD_CMDDONE_M                                     0x00000001
#define NVMNW_STATCMD_CMDDONE_S                                              0
#define NVMNW_STATCMD_CMDDONE_STATDONE                              0x00000001
#define NVMNW_STATCMD_CMDDONE_STATNOTDONE                           0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_STATADDR
//
//*****************************************************************************
// Field: [25:21] BANKID
//
// Current Bank ID
// A bank indicator is stored in this register which represents the current
// bank on
// which the state  machine is operating.  There is 1 bit per bank.
// ENUMs:
// BANK4                    Bank 4
// BANK3                    Bank 3
// BANK2                    Bank 2
// BANK1                    Bank 1
// BANK0                    Bank 0
#define NVMNW_STATADDR_BANKID_W                                              5
#define NVMNW_STATADDR_BANKID_M                                     0x03E00000
#define NVMNW_STATADDR_BANKID_S                                             21
#define NVMNW_STATADDR_BANKID_BANK4                                 0x02000000
#define NVMNW_STATADDR_BANKID_BANK3                                 0x01000000
#define NVMNW_STATADDR_BANKID_BANK2                                 0x00800000
#define NVMNW_STATADDR_BANKID_BANK1                                 0x00400000
#define NVMNW_STATADDR_BANKID_BANK0                                 0x00200000

// Field: [20:16] REGIONID
//
// Current Region ID
// A region indicator is stored in this register which represents the current
// flash
// region on which the state  machine is operating.
// ENUMs:
// ENGR                     Engr Region
// TRIM                     Trim Region
// NONMAIN                  Non-Main Region
// MAIN                     Main Region
#define NVMNW_STATADDR_REGIONID_W                                            5
#define NVMNW_STATADDR_REGIONID_M                                   0x001F0000
#define NVMNW_STATADDR_REGIONID_S                                           16
#define NVMNW_STATADDR_REGIONID_ENGR                                0x00080000
#define NVMNW_STATADDR_REGIONID_TRIM                                0x00040000
#define NVMNW_STATADDR_REGIONID_NONMAIN                             0x00020000
#define NVMNW_STATADDR_REGIONID_MAIN                                0x00010000

// Field:  [15:0] BANKADDR
//
// Current Bank Address
// A bank offset address is stored in this register.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_STATADDR_BANKADDR_W                                           16
#define NVMNW_STATADDR_BANKADDR_M                                   0x0000FFFF
#define NVMNW_STATADDR_BANKADDR_S                                            0
#define NVMNW_STATADDR_BANKADDR_MAXIMUM                             0x0000FFFF
#define NVMNW_STATADDR_BANKADDR_MINIMUM                             0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_STATPCNT
//
//*****************************************************************************
// Field:  [11:0] PULSECNT
//
// Current Pulse Counter Value
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_STATPCNT_PULSECNT_W                                           12
#define NVMNW_STATPCNT_PULSECNT_M                                   0x00000FFF
#define NVMNW_STATPCNT_PULSECNT_S                                            0
#define NVMNW_STATPCNT_PULSECNT_MAXIMUM                             0x00000FFF
#define NVMNW_STATPCNT_PULSECNT_MINIMUM                             0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_STATMODE
//
//*****************************************************************************
// Field:  [11:8] BANKMODE
//
// Indicates mode of bank(s) that are not in READ mode
// ENUMs:
// ERASEBNK                 Erase Bank
// PGMMW                    Program Multiple Word
// LEAKVER                  Leakage Verify Mode
// ERASESECT                Erase Sector
// ERASEVER                 Erase Verify Mode
// PGMSW                    Program Single Word
// PGMVER                   Program Verify Mode
// NOOP                     No Operation
// RDMARG1B                 Read Margin 1B Mode
// RDMARG0B                 Read Margin 0B Mode
// RDMARG1                  Read Margin 1 Mode
// RDMARG0                  Read Margin 0 Mode
// READ                     Read Mode
#define NVMNW_STATMODE_BANKMODE_W                                            4
#define NVMNW_STATMODE_BANKMODE_M                                   0x00000F00
#define NVMNW_STATMODE_BANKMODE_S                                            8
#define NVMNW_STATMODE_BANKMODE_ERASEBNK                            0x00000F00
#define NVMNW_STATMODE_BANKMODE_PGMMW                               0x00000E00
#define NVMNW_STATMODE_BANKMODE_LEAKVER                             0x00000D00
#define NVMNW_STATMODE_BANKMODE_ERASESECT                           0x00000C00
#define NVMNW_STATMODE_BANKMODE_ERASEVER                            0x00000B00
#define NVMNW_STATMODE_BANKMODE_PGMSW                               0x00000A00
#define NVMNW_STATMODE_BANKMODE_PGMVER                              0x00000900
#define NVMNW_STATMODE_BANKMODE_NOOP                                0x00000800
#define NVMNW_STATMODE_BANKMODE_RDMARG1B                            0x00000700
#define NVMNW_STATMODE_BANKMODE_RDMARG0B                            0x00000600
#define NVMNW_STATMODE_BANKMODE_RDMARG1                             0x00000400
#define NVMNW_STATMODE_BANKMODE_RDMARG0                             0x00000200
#define NVMNW_STATMODE_BANKMODE_READ                                0x00000000

// Field:     [0] BANKNOTINRD
//
// Bank not in read mode.
// Indicates which banks are not in READ mode.  There is 1 bit per bank.
// ENUMs:
// BANK4                    Bank 4
// BANK3                    Bank 3
// BANK2                    Bank 2
// BANK1                    Bank 1
// BANK0                    Bank 0
#define NVMNW_STATMODE_BANKNOTINRD                                  0x00000001
#define NVMNW_STATMODE_BANKNOTINRD_BITN                                      0
#define NVMNW_STATMODE_BANKNOTINRD_M                                0x00000001
#define NVMNW_STATMODE_BANKNOTINRD_S                                         0
#define NVMNW_STATMODE_BANKNOTINRD_BANK4                            0x00000010
#define NVMNW_STATMODE_BANKNOTINRD_BANK3                            0x00000008
#define NVMNW_STATMODE_BANKNOTINRD_BANK2                            0x00000004
#define NVMNW_STATMODE_BANKNOTINRD_BANK1                            0x00000002
#define NVMNW_STATMODE_BANKNOTINRD_BANK0                            0x00000001

//*****************************************************************************
//
// Register: NVMNW_O_GBLINFO0
//
//*****************************************************************************
// Field: [18:16] NUMBANKS
//
// Number of banks instantiated
// Minimum:	1
// Maximum:	5
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_GBLINFO0_NUMBANKS_W                                            3
#define NVMNW_GBLINFO0_NUMBANKS_M                                   0x00070000
#define NVMNW_GBLINFO0_NUMBANKS_S                                           16
#define NVMNW_GBLINFO0_NUMBANKS_MAXIMUM                             0x00050000
#define NVMNW_GBLINFO0_NUMBANKS_MINIMUM                             0x00010000

// Field:  [15:0] SECTORSIZE
//
// Sector size in bytes
// ENUMs:
// TWOKB                    Sector size is TWOKB
// ONEKB                    Sector size is ONEKB
#define NVMNW_GBLINFO0_SECTORSIZE_W                                         16
#define NVMNW_GBLINFO0_SECTORSIZE_M                                 0x0000FFFF
#define NVMNW_GBLINFO0_SECTORSIZE_S                                          0
#define NVMNW_GBLINFO0_SECTORSIZE_TWOKB                             0x00000800
#define NVMNW_GBLINFO0_SECTORSIZE_ONEKB                             0x00000400

//*****************************************************************************
//
// Register: NVMNW_O_GBLINFO1
//
//*****************************************************************************
// Field: [18:16] REDWIDTH
//
// Redundant data width in bits
// ENUMs:
// W4BIT                    Redundant data width is 4 bits
// W2BIT                    Redundant data width is 2 bits
// W0BIT                    Redundant data width is 0.  Redundancy/Repair not
//                          present.
#define NVMNW_GBLINFO1_REDWIDTH_W                                            3
#define NVMNW_GBLINFO1_REDWIDTH_M                                   0x00070000
#define NVMNW_GBLINFO1_REDWIDTH_S                                           16
#define NVMNW_GBLINFO1_REDWIDTH_W4BIT                               0x00040000
#define NVMNW_GBLINFO1_REDWIDTH_W2BIT                               0x00020000
#define NVMNW_GBLINFO1_REDWIDTH_W0BIT                               0x00000000

// Field:  [12:8] ECCWIDTH
//
// ECC data width in bits
// ENUMs:
// W16BIT                   ECC data width is 16 bits
// W8BIT                    ECC data width is 8 bits
// W0BIT                    ECC data width is 0.  ECC not used.
#define NVMNW_GBLINFO1_ECCWIDTH_W                                            5
#define NVMNW_GBLINFO1_ECCWIDTH_M                                   0x00001F00
#define NVMNW_GBLINFO1_ECCWIDTH_S                                            8
#define NVMNW_GBLINFO1_ECCWIDTH_W16BIT                              0x00001000
#define NVMNW_GBLINFO1_ECCWIDTH_W8BIT                               0x00000800
#define NVMNW_GBLINFO1_ECCWIDTH_W0BIT                               0x00000000

// Field:   [7:0] DATAWIDTH
//
// Data width in bits
// ENUMs:
// W128BIT                  Data width is 128 bits
// W64BIT                   Data width is 64 bits
#define NVMNW_GBLINFO1_DATAWIDTH_W                                           8
#define NVMNW_GBLINFO1_DATAWIDTH_M                                  0x000000FF
#define NVMNW_GBLINFO1_DATAWIDTH_S                                           0
#define NVMNW_GBLINFO1_DATAWIDTH_W128BIT                            0x00000080
#define NVMNW_GBLINFO1_DATAWIDTH_W64BIT                             0x00000040

//*****************************************************************************
//
// Register: NVMNW_O_BANK0INFO0
//
//*****************************************************************************
// Field:  [11:0] MAINSIZE
//
// Main region size in sectors
// Minimum:	0x8 (8)
// Maximum:	0x200 (512)
// ENUMs:
// MAXSECTORS               Maximum value of MAINSIZE
// MINSECTORS               Minimum value of MAINSIZE
#define NVMNW_BANK0INFO0_MAINSIZE_W                                         12
#define NVMNW_BANK0INFO0_MAINSIZE_M                                 0x00000FFF
#define NVMNW_BANK0INFO0_MAINSIZE_S                                          0
#define NVMNW_BANK0INFO0_MAINSIZE_MAXSECTORS                        0x00000200
#define NVMNW_BANK0INFO0_MAINSIZE_MINSECTORS                        0x00000008

//*****************************************************************************
//
// Register: NVMNW_O_BANK0INFO1
//
//*****************************************************************************
// Field: [23:16] ENGRSIZE
//
// Engr region size in sectors
// Minimum:	0x0 (0)
// Maximum:	0x10 (16)
// ENUMs:
// MAXSECTORS               Maximum value of ENGRSIZE
// MINSECTORS               Minimum value of ENGRSIZE
#define NVMNW_BANK0INFO1_ENGRSIZE_W                                          8
#define NVMNW_BANK0INFO1_ENGRSIZE_M                                 0x00FF0000
#define NVMNW_BANK0INFO1_ENGRSIZE_S                                         16
#define NVMNW_BANK0INFO1_ENGRSIZE_MAXSECTORS                        0x00200000
#define NVMNW_BANK0INFO1_ENGRSIZE_MINSECTORS                        0x00000000

// Field:  [15:8] TRIMSIZE
//
// Trim region size in sectors
// Minimum:	0x0 (0)
// Maximum:	0x10 (16)
// ENUMs:
// MAXSECTORS               Maximum value of TRIMSIZE
// MINSECTORS               Minimum value of TRIMSIZE
#define NVMNW_BANK0INFO1_TRIMSIZE_W                                          8
#define NVMNW_BANK0INFO1_TRIMSIZE_M                                 0x0000FF00
#define NVMNW_BANK0INFO1_TRIMSIZE_S                                          8
#define NVMNW_BANK0INFO1_TRIMSIZE_MAXSECTORS                        0x00002000
#define NVMNW_BANK0INFO1_TRIMSIZE_MINSECTORS                        0x00000000

