espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:   [7:0] NONMAINSIZE
//
// Non-main region size in sectors
// Minimum:	0x0 (0)
// Maximum:	0x10 (16)
// ENUMs:
// MAXSECTORS               Maximum value of NONMAINSIZE
// MINSECTORS               Minimum value of NONMAINSIZE
#define NVMNW_BANK0INFO1_NONMAINSIZE_W                                       8
#define NVMNW_BANK0INFO1_NONMAINSIZE_M                              0x000000FF
#define NVMNW_BANK0INFO1_NONMAINSIZE_S                                       0
#define NVMNW_BANK0INFO1_NONMAINSIZE_MAXSECTORS                     0x00000020
#define NVMNW_BANK0INFO1_NONMAINSIZE_MINSECTORS                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK1INFO0
//
//*****************************************************************************
// Field:  [11:0] MAINSIZE
//
// Main region size in sectors
// Minimum:	0x8 (8)
// Maximum:	0x200 (512)
// ENUMs:
// MAXSECTORS               Maximum value of MAINSIZE
// MINSECTORS               Minimum value of MAINSIZE
#define NVMNW_BANK1INFO0_MAINSIZE_W                                         12
#define NVMNW_BANK1INFO0_MAINSIZE_M                                 0x00000FFF
#define NVMNW_BANK1INFO0_MAINSIZE_S                                          0
#define NVMNW_BANK1INFO0_MAINSIZE_MAXSECTORS                        0x00000200
#define NVMNW_BANK1INFO0_MAINSIZE_MINSECTORS                        0x00000008

//*****************************************************************************
//
// Register: NVMNW_O_BANK1INFO1
//
//*****************************************************************************
// Field: [23:16] ENGRSIZE
//
// Engr region size in sectors
// Minimum:	0x0 (0)
// Maximum:	0x10 (16)
// ENUMs:
// MAXSECTORS               Maximum value of ENGRSIZE
// MINSECTORS               Minimum value of ENGRSIZE
#define NVMNW_BANK1INFO1_ENGRSIZE_W                                          8
#define NVMNW_BANK1INFO1_ENGRSIZE_M                                 0x00FF0000
#define NVMNW_BANK1INFO1_ENGRSIZE_S                                         16
#define NVMNW_BANK1INFO1_ENGRSIZE_MAXSECTORS                        0x00200000
#define NVMNW_BANK1INFO1_ENGRSIZE_MINSECTORS                        0x00000000

// Field:  [15:8] TRIMSIZE
//
// Trim region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of TRIMSIZE
// MINSECTORS               Minimum value of TRIMSIZE
#define NVMNW_BANK1INFO1_TRIMSIZE_W                                          8
#define NVMNW_BANK1INFO1_TRIMSIZE_M                                 0x0000FF00
#define NVMNW_BANK1INFO1_TRIMSIZE_S                                          8
#define NVMNW_BANK1INFO1_TRIMSIZE_MAXSECTORS                        0x00002000
#define NVMNW_BANK1INFO1_TRIMSIZE_MINSECTORS                        0x00000000

// Field:   [7:0] NONMAINSIZE
//
// Non-main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of NONMAINSIZE
// MINSECTORS               Minimum value of NONMAINSIZE
#define NVMNW_BANK1INFO1_NONMAINSIZE_W                                       8
#define NVMNW_BANK1INFO1_NONMAINSIZE_M                              0x000000FF
#define NVMNW_BANK1INFO1_NONMAINSIZE_S                                       0
#define NVMNW_BANK1INFO1_NONMAINSIZE_MAXSECTORS                     0x00000020
#define NVMNW_BANK1INFO1_NONMAINSIZE_MINSECTORS                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK2INFO0
//
//*****************************************************************************
// Field:  [11:0] MAINSIZE
//
// Main region size in sectors
// Minimum:	0x8 (8)
// Maximum:	0x200 (512)
// ENUMs:
// MAXSECTORS               Maximum value of MAINSIZE
// MINSECTORS               Minimum value of MAINSIZE
#define NVMNW_BANK2INFO0_MAINSIZE_W                                         12
#define NVMNW_BANK2INFO0_MAINSIZE_M                                 0x00000FFF
#define NVMNW_BANK2INFO0_MAINSIZE_S                                          0
#define NVMNW_BANK2INFO0_MAINSIZE_MAXSECTORS                        0x00000200
#define NVMNW_BANK2INFO0_MAINSIZE_MINSECTORS                        0x00000008

//*****************************************************************************
//
// Register: NVMNW_O_BANK2INFO1
//
//*****************************************************************************
// Field: [23:16] ENGRSIZE
//
// Engr region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of ENGRSIZE
// MINSECTORS               Minimum value of ENGRSIZE
#define NVMNW_BANK2INFO1_ENGRSIZE_W                                          8
#define NVMNW_BANK2INFO1_ENGRSIZE_M                                 0x00FF0000
#define NVMNW_BANK2INFO1_ENGRSIZE_S                                         16
#define NVMNW_BANK2INFO1_ENGRSIZE_MAXSECTORS                        0x00200000
#define NVMNW_BANK2INFO1_ENGRSIZE_MINSECTORS                        0x00000000

// Field:  [15:8] TRIMSIZE
//
// Trim region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of TRIMSIZE
// MINSECTORS               Minimum value of TRIMSIZE
#define NVMNW_BANK2INFO1_TRIMSIZE_W                                          8
#define NVMNW_BANK2INFO1_TRIMSIZE_M                                 0x0000FF00
#define NVMNW_BANK2INFO1_TRIMSIZE_S                                          8
#define NVMNW_BANK2INFO1_TRIMSIZE_MAXSECTORS                        0x00002000
#define NVMNW_BANK2INFO1_TRIMSIZE_MINSECTORS                        0x00000000

// Field:   [7:0] NONMAINSIZE
//
// Non-main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of NONMAINSIZE
// MINSECTORS               Minimum value of NONMAINSIZE
#define NVMNW_BANK2INFO1_NONMAINSIZE_W                                       8
#define NVMNW_BANK2INFO1_NONMAINSIZE_M                              0x000000FF
#define NVMNW_BANK2INFO1_NONMAINSIZE_S                                       0
#define NVMNW_BANK2INFO1_NONMAINSIZE_MAXSECTORS                     0x00000020
#define NVMNW_BANK2INFO1_NONMAINSIZE_MINSECTORS                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK3INFO0
//
//*****************************************************************************
// Field:  [11:0] MAINSIZE
//
// Main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of MAINSIZE
// MINSECTORS               Minimum value of MAINSIZE
#define NVMNW_BANK3INFO0_MAINSIZE_W                                         12
#define NVMNW_BANK3INFO0_MAINSIZE_M                                 0x00000FFF
#define NVMNW_BANK3INFO0_MAINSIZE_S                                          0
#define NVMNW_BANK3INFO0_MAINSIZE_MAXSECTORS                        0x00000200
#define NVMNW_BANK3INFO0_MAINSIZE_MINSECTORS                        0x00000008

//*****************************************************************************
//
// Register: NVMNW_O_BANK3INFO1
//
//*****************************************************************************
// Field: [23:16] ENGRSIZE
//
// Engr region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of ENGRSIZE
// MINSECTORS               Minimum value of ENGRSIZE
#define NVMNW_BANK3INFO1_ENGRSIZE_W                                          8
#define NVMNW_BANK3INFO1_ENGRSIZE_M                                 0x00FF0000
#define NVMNW_BANK3INFO1_ENGRSIZE_S                                         16
#define NVMNW_BANK3INFO1_ENGRSIZE_MAXSECTORS                        0x00200000
#define NVMNW_BANK3INFO1_ENGRSIZE_MINSECTORS                        0x00000000

// Field:  [15:8] TRIMSIZE
//
// Trim region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of TRIMSIZE
// MINSECTORS               Minimum value of TRIMSIZE
#define NVMNW_BANK3INFO1_TRIMSIZE_W                                          8
#define NVMNW_BANK3INFO1_TRIMSIZE_M                                 0x0000FF00
#define NVMNW_BANK3INFO1_TRIMSIZE_S                                          8
#define NVMNW_BANK3INFO1_TRIMSIZE_MAXSECTORS                        0x00002000
#define NVMNW_BANK3INFO1_TRIMSIZE_MINSECTORS                        0x00000000

