espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:   [7:0] NONMAINSIZE
//
// Non-main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of NONMAINSIZE
// MINSECTORS               Minimum value of NONMAINSIZE
#define NVMNW_BANK3INFO1_NONMAINSIZE_W                                       8
#define NVMNW_BANK3INFO1_NONMAINSIZE_M                              0x000000FF
#define NVMNW_BANK3INFO1_NONMAINSIZE_S                                       0
#define NVMNW_BANK3INFO1_NONMAINSIZE_MAXSECTORS                     0x00000020
#define NVMNW_BANK3INFO1_NONMAINSIZE_MINSECTORS                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK4INFO0
//
//*****************************************************************************
// Field:  [11:0] MAINSIZE
//
// Main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of MAINSIZE
// MINSECTORS               Minimum value of MAINSIZE
#define NVMNW_BANK4INFO0_MAINSIZE_W                                         12
#define NVMNW_BANK4INFO0_MAINSIZE_M                                 0x00000FFF
#define NVMNW_BANK4INFO0_MAINSIZE_S                                          0
#define NVMNW_BANK4INFO0_MAINSIZE_MAXSECTORS                        0x00000200
#define NVMNW_BANK4INFO0_MAINSIZE_MINSECTORS                        0x00000008

//*****************************************************************************
//
// Register: NVMNW_O_BANK4INFO1
//
//*****************************************************************************
// Field: [23:16] ENGRSIZE
//
// Engr region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of ENGRSIZE
// MINSECTORS               Minimum value of ENGRSIZE
#define NVMNW_BANK4INFO1_ENGRSIZE_W                                          8
#define NVMNW_BANK4INFO1_ENGRSIZE_M                                 0x00FF0000
#define NVMNW_BANK4INFO1_ENGRSIZE_S                                         16
#define NVMNW_BANK4INFO1_ENGRSIZE_MAXSECTORS                        0x00200000
#define NVMNW_BANK4INFO1_ENGRSIZE_MINSECTORS                        0x00000000

// Field:  [15:8] TRIMSIZE
//
// Trim region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of TRIMSIZE
// MINSECTORS               Minimum value of TRIMSIZE
#define NVMNW_BANK4INFO1_TRIMSIZE_W                                          8
#define NVMNW_BANK4INFO1_TRIMSIZE_M                                 0x0000FF00
#define NVMNW_BANK4INFO1_TRIMSIZE_S                                          8
#define NVMNW_BANK4INFO1_TRIMSIZE_MAXSECTORS                        0x00002000
#define NVMNW_BANK4INFO1_TRIMSIZE_MINSECTORS                        0x00000000

// Field:   [7:0] NONMAINSIZE
//
// Non-main region size in sectors
// ENUMs:
// MAXSECTORS               Maximum value of NONMAINSIZE
// MINSECTORS               Minimum value of NONMAINSIZE
#define NVMNW_BANK4INFO1_NONMAINSIZE_W                                       8
#define NVMNW_BANK4INFO1_NONMAINSIZE_M                              0x000000FF
#define NVMNW_BANK4INFO1_NONMAINSIZE_S                                       0
#define NVMNW_BANK4INFO1_NONMAINSIZE_MAXSECTORS                     0x00000020
#define NVMNW_BANK4INFO1_NONMAINSIZE_MINSECTORS                     0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTEN
//
//*****************************************************************************
// Field:     [0] ENABLE
//
// Enable Test Features
// Enumeration:
// 0x0:	Test features disabled
// 0x1: Test features enabled
// ENUMs:
// ENABLED                  Command
// DISABLED                 Command
#define NVMNW_DFTEN_ENABLE                                          0x00000001
#define NVMNW_DFTEN_ENABLE_BITN                                              0
#define NVMNW_DFTEN_ENABLE_M                                        0x00000001
#define NVMNW_DFTEN_ENABLE_S                                                 0
#define NVMNW_DFTEN_ENABLE_ENABLED                                  0x00000001
#define NVMNW_DFTEN_ENABLE_DISABLED                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTCMDCTL
//
//*****************************************************************************
// Field: [31:28] DTBMUXSEL
//
// DTB Mux Select
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_DFTCMDCTL_DTBMUXSEL_W                                          4
#define NVMNW_DFTCMDCTL_DTBMUXSEL_M                                 0xF0000000
#define NVMNW_DFTCMDCTL_DTBMUXSEL_S                                         28
#define NVMNW_DFTCMDCTL_DTBMUXSEL_MAXIMUM                           0xF0000000
#define NVMNW_DFTCMDCTL_DTBMUXSEL_MINIMUM                           0x00000000

// Field:    [20] STOPVERONFAIL
//
// Stop read verify on fail.  If this bit is set, read verify will halt when
// the first verify
// fail is detected.  If command is program or erase, another program or erase
// pulse will be executed.  If command is read verify, comand will terminate.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTCMDCTL_STOPVERONFAIL                               0x00100000
#define NVMNW_DFTCMDCTL_STOPVERONFAIL_BITN                                  20
#define NVMNW_DFTCMDCTL_STOPVERONFAIL_M                             0x00100000
#define NVMNW_DFTCMDCTL_STOPVERONFAIL_S                                     20
#define NVMNW_DFTCMDCTL_STOPVERONFAIL_ENABLE                        0x00100000
#define NVMNW_DFTCMDCTL_STOPVERONFAIL_DISABLE                       0x00000000

// Field:    [18] ODDROWINVDATA
//
// Invert data at odd row addresses for program or verify.  The LSB of the row
// address is bit [4] of the bank address.  This bit only applies when pattern
// data
// is used; i.e. the DATAPATEN bit is set.  It will have no effect if CMDDATA
// is used.
// ENUMs:
// INVERT                   Use inverted data
// TRUE                     Use true data
#define NVMNW_DFTCMDCTL_ODDROWINVDATA                               0x00040000
#define NVMNW_DFTCMDCTL_ODDROWINVDATA_BITN                                  18
#define NVMNW_DFTCMDCTL_ODDROWINVDATA_M                             0x00040000
#define NVMNW_DFTCMDCTL_ODDROWINVDATA_S                                     18
#define NVMNW_DFTCMDCTL_ODDROWINVDATA_INVERT                        0x00040000
#define NVMNW_DFTCMDCTL_ODDROWINVDATA_TRUE                          0x00000000

// Field:    [17] ODDWORDINVDATA
//
// Invert data at odd bank addresses for program or verify. This bit only
// applies
// when pattern data is used; i.e. the DATAPATEN bit is set.  It will have no
// effect
// if CMDDATA is used.
// ENUMs:
// INVERT                   Use inverted data
// TRUE                     Use true data
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA                              0x00020000
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA_BITN                                 17
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA_M                            0x00020000
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA_S                                    17
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA_INVERT                       0x00020000
#define NVMNW_DFTCMDCTL_ODDWORDINVDATA_TRUE                         0x00000000

