espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:    [16] ALWAYSINVDATA
//
// Invert data always for program or verify.  This bit only applies when
// pattern data
// is used; i.e. the DATAPATEN bit is set.  It will have no effect if CMDDATA
// is used.
// ENUMs:
// INVERT                   Use inverted data
// TRUE                     Use true data
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA                               0x00010000
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA_BITN                                  16
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA_M                             0x00010000
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA_S                                     16
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA_INVERT                        0x00010000
#define NVMNW_DFTCMDCTL_ALWAYSINVDATA_TRUE                          0x00000000

// Field: [15:13] DATAPATSEL
//
// Select data pattern.  Valid when DATAPATEN bit is set to 1.  Overrides
// CMDDATA
// registers for program or verify.
// ENUMs:
// LOGCHKBRD                Set to logical checkerboard (0x01010101...)
// ALL1                     Set to all 1
// ALL0                     Set to all 0
#define NVMNW_DFTCMDCTL_DATAPATSEL_W                                         3
#define NVMNW_DFTCMDCTL_DATAPATSEL_M                                0x0000E000
#define NVMNW_DFTCMDCTL_DATAPATSEL_S                                        13
#define NVMNW_DFTCMDCTL_DATAPATSEL_LOGCHKBRD                        0x00004000
#define NVMNW_DFTCMDCTL_DATAPATSEL_ALL1                             0x00002000
#define NVMNW_DFTCMDCTL_DATAPATSEL_ALL0                             0x00000000

// Field:    [12] DATAPATEN
//
// Enable data pattern.  Data pattern select in DATAPAT_SEL field will override
// data
// from CMDDATA registers for use as program or verify data.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTCMDCTL_DATAPATEN                                   0x00001000
#define NVMNW_DFTCMDCTL_DATAPATEN_BITN                                      12
#define NVMNW_DFTCMDCTL_DATAPATEN_M                                 0x00001000
#define NVMNW_DFTCMDCTL_DATAPATEN_S                                         12
#define NVMNW_DFTCMDCTL_DATAPATEN_ENABLE                            0x00001000
#define NVMNW_DFTCMDCTL_DATAPATEN_DISABLE                           0x00000000

// Field:     [9] PULSECNTLDDIS
//
// Override pulse counter enable.
// When set, the state machine pulse counter will not be loaded when a
// command is initiated.
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS                               0x00000200
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS_BITN                                   9
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS_M                             0x00000200
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS_S                                      9
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS_DISABLE                       0x00000200
#define NVMNW_DFTCMDCTL_PULSECNTLDDIS_ENABLE                        0x00000000

// Field:     [8] ADDRCNTLDDIS
//
// Override address counter enable.
// When set, the state machine address counter will not be loaded when a
// command is initiated.
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS                                0x00000100
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS_BITN                                    8
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS_M                              0x00000100
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS_S                                       8
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS_DISABLE                        0x00000100
#define NVMNW_DFTCMDCTL_ADDRCNTLDDIS_ENABLE                         0x00000000

// Field:     [5] REDMATCHFORCE
//
// Force redundancy match.  If set to 1, repair configuration encoded in the
// flash
// bank trim will be forced for every access.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTCMDCTL_REDMATCHFORCE                               0x00000020
#define NVMNW_DFTCMDCTL_REDMATCHFORCE_BITN                                   5
#define NVMNW_DFTCMDCTL_REDMATCHFORCE_M                             0x00000020
#define NVMNW_DFTCMDCTL_REDMATCHFORCE_S                                      5
#define NVMNW_DFTCMDCTL_REDMATCHFORCE_ENABLE                        0x00000020
#define NVMNW_DFTCMDCTL_REDMATCHFORCE_DISABLE                       0x00000000

// Field:     [4] REDMATCHDIS
//
// Disable redundancy matching.  Any repair configuration encoded into the
// bank trim bits is disabled.
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_DFTCMDCTL_REDMATCHDIS                                 0x00000010
#define NVMNW_DFTCMDCTL_REDMATCHDIS_BITN                                     4
#define NVMNW_DFTCMDCTL_REDMATCHDIS_M                               0x00000010
#define NVMNW_DFTCMDCTL_REDMATCHDIS_S                                        4
#define NVMNW_DFTCMDCTL_REDMATCHDIS_DISABLE                         0x00000010
#define NVMNW_DFTCMDCTL_REDMATCHDIS_ENABLE                          0x00000000

// Field:     [2] AMX2TDIS
//
// 2T address mux disable control. When set to 1 2T address shifting is
// disabled.
// ENUMs:
// DISABLE                  Disable
// ENABLE                   Enable
#define NVMNW_DFTCMDCTL_AMX2TDIS                                    0x00000004
#define NVMNW_DFTCMDCTL_AMX2TDIS_BITN                                        2
#define NVMNW_DFTCMDCTL_AMX2TDIS_M                                  0x00000004
#define NVMNW_DFTCMDCTL_AMX2TDIS_S                                           2
#define NVMNW_DFTCMDCTL_AMX2TDIS_DISABLE                            0x00000004
#define NVMNW_DFTCMDCTL_AMX2TDIS_ENABLE                             0x00000000

// Field:     [1] FORCE2TEN
//
// Force 2T Enable - Force 2T access to regions that are designated as 1T.
// Regions
// designated as 2T will still be accessed as 2T.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTCMDCTL_FORCE2TEN                                   0x00000002
#define NVMNW_DFTCMDCTL_FORCE2TEN_BITN                                       1
#define NVMNW_DFTCMDCTL_FORCE2TEN_M                                 0x00000002
#define NVMNW_DFTCMDCTL_FORCE2TEN_S                                          1
#define NVMNW_DFTCMDCTL_FORCE2TEN_ENABLE                            0x00000002
#define NVMNW_DFTCMDCTL_FORCE2TEN_DISABLE                           0x00000000

// Field:     [0] FORCE1TEN
//
// Force 1T Enable - Force 1T access to regions that are designated as 2T.
// Regions
// designated as 1T will still be accessed as 1T.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTCMDCTL_FORCE1TEN                                   0x00000001
#define NVMNW_DFTCMDCTL_FORCE1TEN_BITN                                       0
#define NVMNW_DFTCMDCTL_FORCE1TEN_M                                 0x00000001
#define NVMNW_DFTCMDCTL_FORCE1TEN_S                                          0
#define NVMNW_DFTCMDCTL_FORCE1TEN_ENABLE                            0x00000001
#define NVMNW_DFTCMDCTL_FORCE1TEN_DISABLE                           0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTTIMERCTL
//
//*****************************************************************************
// Field: [30:28] TIMERCLOCKOVR
//
// Override Timer clock frequency using an ICG-based clock divide mechanism.
// To divide the timer clock, pulses can be skipped based on settings in this
// field.
// Enumeration:
// 0: No division on timer clock
// 1-7: Divide timer clock by 2-8
// ENUMs:
// DIVIDEBY8                Divide timer clock by 8
// DIVIDEBY7                Divide timer clock by 7
// DIVIDEBY6                Divide timer clock by 6
// DIVIDEBY5                Divide timer clock by 5
// DIVIDEBY4                Divide timer clock by 4
// DIVIDEBY3                Divide timer clock by 3
// DIVIDEBY2                Divide timer clock by 2
// NODIVIDE                 No divide on timer clock.
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_W                                    3
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_M                           0x70000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_S                                   28
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY8                   0x70000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY7                   0x60000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY6                   0x50000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY5                   0x40000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY4                   0x30000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY3                   0x20000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_DIVIDEBY2                   0x10000000
#define NVMNW_DFTTIMERCTL_TIMERCLOCKOVR_NODIVIDE                    0x00000000

// Field: [27:12] PEPULSETIMEVAL
//
// Program/Erase Pulse Time Value
// If operation is a program, this value gets loaded into bits [15:0] of the
// timer
// when the PEPULSETIMEVAL_OVR field is set to 1.
// If operation is an erase, this value gets loaded into bits [19:4] of the
// timer
// when the PEPULSETIMEVAL_OVR field is set to 1.
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_DFTTIMERCTL_PEPULSETIMEVAL_W                                  16
#define NVMNW_DFTTIMERCTL_PEPULSETIMEVAL_M                          0x0FFFF000
#define NVMNW_DFTTIMERCTL_PEPULSETIMEVAL_S                                  12
#define NVMNW_DFTTIMERCTL_PEPULSETIMEVAL_MAXIMUM                    0x0FFFF000
#define NVMNW_DFTTIMERCTL_PEPULSETIMEVAL_MINIMUM                    0x00001000

// Field:     [8] PEPULSETIMEOVR
//
// Override Program/Erase Pulse Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use bits [31:16] of this register as time value
// ENUMs:
// OVERRIDE                 Use value from the PE_PULSE_TIME field for time
//                          value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR                            0x00000100
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR_BITN                                8
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR_M                          0x00000100
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR_S                                   8
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR_OVERRIDE                   0x00000100
#define NVMNW_DFTTIMERCTL_PEPULSETIMEOVR_FUNCTIONAL                 0x00000000

// Field:     [7] READMODETIME
//
// Read Mode Change Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_READMODETIME                              0x00000080
#define NVMNW_DFTTIMERCTL_READMODETIME_BITN                                  7
#define NVMNW_DFTTIMERCTL_READMODETIME_M                            0x00000080
#define NVMNW_DFTTIMERCTL_READMODETIME_S                                     7
#define NVMNW_DFTTIMERCTL_READMODETIME_TWOXFUNCTIONAL               0x00000080
#define NVMNW_DFTTIMERCTL_READMODETIME_FUNCTIONAL                   0x00000000

// Field:     [6] PEVHOLDTIME
//
// Program/Erase Verify Hold Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME                               0x00000040
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME_BITN                                   6
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME_M                             0x00000040
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME_S                                      6
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME_TWOXFUNCTIONAL                0x00000040
#define NVMNW_DFTTIMERCTL_PEVHOLDTIME_FUNCTIONAL                    0x00000000

// Field:     [5] PEVSETUPTIME
//
// Program/Erase Verify Setup Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME                              0x00000020
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME_BITN                                  5
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME_M                            0x00000020
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME_S                                     5
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME_TWOXFUNCTIONAL               0x00000020
#define NVMNW_DFTTIMERCTL_PEVSETUPTIME_FUNCTIONAL                   0x00000000

// Field:     [4] PEVMODETIME
//
// Program/Erase Verify Mode Change Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PEVMODETIME                               0x00000010
#define NVMNW_DFTTIMERCTL_PEVMODETIME_BITN                                   4
#define NVMNW_DFTTIMERCTL_PEVMODETIME_M                             0x00000010
#define NVMNW_DFTTIMERCTL_PEVMODETIME_S                                      4
#define NVMNW_DFTTIMERCTL_PEVMODETIME_TWOXFUNCTIONAL                0x00000010
#define NVMNW_DFTTIMERCTL_PEVMODETIME_FUNCTIONAL                    0x00000000

// Field:     [3] PEHOLDTIME
//
// Program/Erase Hold Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PEHOLDTIME                                0x00000008
#define NVMNW_DFTTIMERCTL_PEHOLDTIME_BITN                                    3
#define NVMNW_DFTTIMERCTL_PEHOLDTIME_M                              0x00000008
#define NVMNW_DFTTIMERCTL_PEHOLDTIME_S                                       3
#define NVMNW_DFTTIMERCTL_PEHOLDTIME_TWOXFUNCTIONAL                 0x00000008
#define NVMNW_DFTTIMERCTL_PEHOLDTIME_FUNCTIONAL                     0x00000000

// Field:     [2] PPVWORDLINETIME
//
// Program and Program Verify Wordline Switching Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME                           0x00000004
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME_BITN                               2
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME_M                         0x00000004
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME_S                                  2
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME_TWOXFUNCTIONAL            0x00000004
#define NVMNW_DFTTIMERCTL_PPVWORDLINETIME_FUNCTIONAL                0x00000000

