espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
// Field:     [1] PVHVSETUPTIME
//
// Program VHV Setup Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME                             0x00000002
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME_BITN                                 1
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME_M                           0x00000002
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME_S                                    1
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME_TWOXFUNCTIONAL              0x00000002
#define NVMNW_DFTTIMERCTL_PVHVSETUPTIME_FUNCTIONAL                  0x00000000

// Field:     [0] PESETUPTIME
//
// Program/Erase Setup Time
// Enumeration:
// 0: Use hard-wired time value
// 1: Use 2x the hard-wired time value
// ENUMs:
// TWOXFUNCTIONAL           Use 2x the hard-wired (functional) time value
// FUNCTIONAL               Use hard-wired (Functional) timer value
#define NVMNW_DFTTIMERCTL_PESETUPTIME                               0x00000001
#define NVMNW_DFTTIMERCTL_PESETUPTIME_BITN                                   0
#define NVMNW_DFTTIMERCTL_PESETUPTIME_M                             0x00000001
#define NVMNW_DFTTIMERCTL_PESETUPTIME_S                                      0
#define NVMNW_DFTTIMERCTL_PESETUPTIME_TWOXFUNCTIONAL                0x00000001
#define NVMNW_DFTTIMERCTL_PESETUPTIME_FUNCTIONAL                    0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTEXECZCTL
//
//*****************************************************************************
// Field:     [1] EXEZ_OVR
//
// Override value to be applied to EXECUTEZ
// ENUMs:
// ONE                      Set EXECUTEZ to 1
// ZERO                     Set EXECUTEZ to 0
#define NVMNW_DFTEXECZCTL_EXEZ_OVR                                  0x00000002
#define NVMNW_DFTEXECZCTL_EXEZ_OVR_BITN                                      1
#define NVMNW_DFTEXECZCTL_EXEZ_OVR_M                                0x00000002
#define NVMNW_DFTEXECZCTL_EXEZ_OVR_S                                         1
#define NVMNW_DFTEXECZCTL_EXEZ_OVR_ONE                              0x00000002
#define NVMNW_DFTEXECZCTL_EXEZ_OVR_ZERO                             0x00000000

// Field:     [0] EXEZOVREN
//
// Enable override of EXECUTEZ
// Enumeration:
// 0: Override of EXECUTEZ disabled
// 1: Override of EXECUTEZ enabled
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTEXECZCTL_EXEZOVREN                                 0x00000001
#define NVMNW_DFTEXECZCTL_EXEZOVREN_BITN                                     0
#define NVMNW_DFTEXECZCTL_EXEZOVREN_M                               0x00000001
#define NVMNW_DFTEXECZCTL_EXEZOVREN_S                                        0
#define NVMNW_DFTEXECZCTL_EXEZOVREN_ENABLE                          0x00000001
#define NVMNW_DFTEXECZCTL_EXEZOVREN_DISABLE                         0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTPCLKTESTCTL
//
//*****************************************************************************
// Field:     [0] ENABLE
//
// Enable the state machine which sequences measurement of pump clock
// frequency.
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTPCLKTESTCTL_ENABLE                                 0x00000001
#define NVMNW_DFTPCLKTESTCTL_ENABLE_BITN                                     0
#define NVMNW_DFTPCLKTESTCTL_ENABLE_M                               0x00000001
#define NVMNW_DFTPCLKTESTCTL_ENABLE_S                                        0
#define NVMNW_DFTPCLKTESTCTL_ENABLE_ENABLE                          0x00000001
#define NVMNW_DFTPCLKTESTCTL_ENABLE_DISABLE                         0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTPCLKTESTSTAT
//
//*****************************************************************************
// Field:  [15:4] CLOCKCNT
//
// Indicates the core clock count captured during the pump clock measurement.
// ENUMs:
// MAXIMUM                  Maximum count value
// MINIMUM                  Minimum count value
#define NVMNW_DFTPCLKTESTSTAT_CLOCKCNT_W                                    12
#define NVMNW_DFTPCLKTESTSTAT_CLOCKCNT_M                            0x0000FFF0
#define NVMNW_DFTPCLKTESTSTAT_CLOCKCNT_S                                     4
#define NVMNW_DFTPCLKTESTSTAT_CLOCKCNT_MAXIMUM                      0x0000FFF0
#define NVMNW_DFTPCLKTESTSTAT_CLOCKCNT_MINIMUM                      0x00000000

// Field:     [0] BUSY
//
// Indicates that a pump clock measurement is in progress.
// ENUMs:
// INPROGRESS               Indicates test in progress
// COMPLETE                 Indicates test complete
#define NVMNW_DFTPCLKTESTSTAT_BUSY                                  0x00000001
#define NVMNW_DFTPCLKTESTSTAT_BUSY_BITN                                      0
#define NVMNW_DFTPCLKTESTSTAT_BUSY_M                                0x00000001
#define NVMNW_DFTPCLKTESTSTAT_BUSY_S                                         0
#define NVMNW_DFTPCLKTESTSTAT_BUSY_INPROGRESS                       0x00000001
#define NVMNW_DFTPCLKTESTSTAT_BUSY_COMPLETE                         0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED0
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED0_VAL_W                                              4
#define NVMNW_DFTDATARED0_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED0_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED1
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED1_VAL_W                                              4
#define NVMNW_DFTDATARED1_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED1_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED2
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED2_VAL_W                                              4
#define NVMNW_DFTDATARED2_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED2_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED3
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED3_VAL_W                                              4
#define NVMNW_DFTDATARED3_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED3_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED4
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED4_VAL_W                                              4
#define NVMNW_DFTDATARED4_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED4_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED5
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED5_VAL_W                                              4
#define NVMNW_DFTDATARED5_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED5_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED6
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED6_VAL_W                                              4
#define NVMNW_DFTDATARED6_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED6_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTDATARED7
//
//*****************************************************************************
// Field:   [3:0] VAL
//
// Data for redundant bits
#define NVMNW_DFTDATARED7_VAL_W                                              4
#define NVMNW_DFTDATARED7_VAL_M                                     0x0000000F
#define NVMNW_DFTDATARED7_VAL_S                                              0

//*****************************************************************************
//
// Register: NVMNW_O_DFTPUMPCTL
//
//*****************************************************************************
// Field: [18:16] IREFEVCTL
//
// IREFEV control IREFVRD, REFTC, IREFCONST, IREFCCOR blocks in IREFEV
#define NVMNW_DFTPUMPCTL_IREFEVCTL_W                                         3
#define NVMNW_DFTPUMPCTL_IREFEVCTL_M                                0x00070000
#define NVMNW_DFTPUMPCTL_IREFEVCTL_S                                        16

// Field: [15:12] CONFIGPMP
//
// Pump configuration control. LP, HP operation
#define NVMNW_DFTPUMPCTL_CONFIGPMP_W                                         4
#define NVMNW_DFTPUMPCTL_CONFIGPMP_M                                0x0000F000
#define NVMNW_DFTPUMPCTL_CONFIGPMP_S                                        12

// Field:     [9] SSEN
//
// Dither control for oscillator
// Enumeration:
// 0: Disable Dither
// 1: Enable Dither
// ENUMs:
// ENABLE                   Enable
// DISABLE                  Disable
#define NVMNW_DFTPUMPCTL_SSEN                                       0x00000200
#define NVMNW_DFTPUMPCTL_SSEN_BITN                                           9
#define NVMNW_DFTPUMPCTL_SSEN_M                                     0x00000200
#define NVMNW_DFTPUMPCTL_SSEN_S                                              9
#define NVMNW_DFTPUMPCTL_SSEN_ENABLE                                0x00000200
#define NVMNW_DFTPUMPCTL_SSEN_DISABLE                               0x00000000

// Field:     [8] PUMPCLKEN
//
// Allows direct control of the pump oscillator which is used to generate
// pumpclk.
// Normally, enable/disable of pumpclk is under NoWrapper state machine
// control.  This bit allows system to enable the clock independently.
// ENUMs:
// ENABLE                   Force pump clock oscillator to be enabled.
// HWCTL                    Allow pump clock oscillator to be controlled by
//                          hardware.
#define NVMNW_DFTPUMPCTL_PUMPCLKEN                                  0x00000100
#define NVMNW_DFTPUMPCTL_PUMPCLKEN_BITN                                      8
#define NVMNW_DFTPUMPCTL_PUMPCLKEN_M                                0x00000100
#define NVMNW_DFTPUMPCTL_PUMPCLKEN_S                                         8
#define NVMNW_DFTPUMPCTL_PUMPCLKEN_ENABLE                           0x00000100
#define NVMNW_DFTPUMPCTL_PUMPCLKEN_HWCTL                            0x00000000

// Field:   [6:0] TCR
//
// TCR test mode to be applied to the pump
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_DFTPUMPCTL_TCR_W                                               7
#define NVMNW_DFTPUMPCTL_TCR_M                                      0x0000007F
#define NVMNW_DFTPUMPCTL_TCR_S                                               0
#define NVMNW_DFTPUMPCTL_TCR_MAXIMUM                                0x0000007F
#define NVMNW_DFTPUMPCTL_TCR_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_DFTBANKCTL
//
//*****************************************************************************
// Field:     [8] TEZ
//
// When set, TEZ is asserted to the flash banks.  Which banks get the asserted
//
// signal is determined by the BANKSELECT field in CMDCTL.
// 0x0 Do no assert TEZ
// 0x1 Assert TEZ
// ENUMs:
// NEGATE                   Do not assert TEZ
// ASSERT                   Assert TEZ
#define NVMNW_DFTBANKCTL_TEZ                                        0x00000100
#define NVMNW_DFTBANKCTL_TEZ_BITN                                            8
#define NVMNW_DFTBANKCTL_TEZ_M                                      0x00000100
#define NVMNW_DFTBANKCTL_TEZ_S                                               8
#define NVMNW_DFTBANKCTL_TEZ_NEGATE                                 0x00000100
#define NVMNW_DFTBANKCTL_TEZ_ASSERT                                 0x00000000

// Field:   [6:0] TCR
//
// TCR test mode to be applied to the bank
// ENUMs:
// MAXIMUM                  Maximum value
// MINIMUM                  Minimum value
#define NVMNW_DFTBANKCTL_TCR_W                                               7
#define NVMNW_DFTBANKCTL_TCR_M                                      0x0000007F
#define NVMNW_DFTBANKCTL_TCR_S                                               0
#define NVMNW_DFTBANKCTL_TCR_MAXIMUM                                0x0000007F
#define NVMNW_DFTBANKCTL_TCR_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_TRIMCTL
//
//*****************************************************************************
// Field:     [0] ENABLE
//
// Indicate that Bank and Pump trim values are valid.
// ENUMs:
// VALID                    Trim data is valid
// INVALID                  Trim data is not valid
#define NVMNW_TRIMCTL_ENABLE                                        0x00000001
#define NVMNW_TRIMCTL_ENABLE_BITN                                            0
#define NVMNW_TRIMCTL_ENABLE_M                                      0x00000001
#define NVMNW_TRIMCTL_ENABLE_S                                               0
#define NVMNW_TRIMCTL_ENABLE_VALID                                  0x00000001
#define NVMNW_TRIMCTL_ENABLE_INVALID                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_PUMPTRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_PUMPTRIM0_VAL_W                                               32
#define NVMNW_PUMPTRIM0_VAL_M                                       0xFFFFFFFF
#define NVMNW_PUMPTRIM0_VAL_S                                                0
#define NVMNW_PUMPTRIM0_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_PUMPTRIM0_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_PUMPTRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_PUMPTRIM1_VAL_W                                               32
#define NVMNW_PUMPTRIM1_VAL_M                                       0xFFFFFFFF
#define NVMNW_PUMPTRIM1_VAL_S                                                0
#define NVMNW_PUMPTRIM1_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_PUMPTRIM1_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_PUMPTRIM2
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_PUMPTRIM2_VAL_W                                               32
#define NVMNW_PUMPTRIM2_VAL_M                                       0xFFFFFFFF
#define NVMNW_PUMPTRIM2_VAL_S                                                0
#define NVMNW_PUMPTRIM2_VAL_MAXIMUM                                 0xFFFFFFFF
#define NVMNW_PUMPTRIM2_VAL_MINIMUM                                 0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK0TRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK0TRIM0_VAL_W                                              32
#define NVMNW_BANK0TRIM0_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK0TRIM0_VAL_S                                               0
#define NVMNW_BANK0TRIM0_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_BANK0TRIM0_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK0TRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK0TRIM1_VAL_W                                              32
#define NVMNW_BANK0TRIM1_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK0TRIM1_VAL_S                                               0
#define NVMNW_BANK0TRIM1_VAL_MAXIMUM                                0x0FFFFFFF
#define NVMNW_BANK0TRIM1_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK1TRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK1TRIM0_VAL_W                                              32
#define NVMNW_BANK1TRIM0_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK1TRIM0_VAL_S                                               0
#define NVMNW_BANK1TRIM0_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_BANK1TRIM0_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK1TRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK1TRIM1_VAL_W                                              32
#define NVMNW_BANK1TRIM1_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK1TRIM1_VAL_S                                               0
#define NVMNW_BANK1TRIM1_VAL_MAXIMUM                                0x0FFFFFFF
#define NVMNW_BANK1TRIM1_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK2TRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK2TRIM0_VAL_W                                              32
#define NVMNW_BANK2TRIM0_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK2TRIM0_VAL_S                                               0
#define NVMNW_BANK2TRIM0_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_BANK2TRIM0_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK2TRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK2TRIM1_VAL_W                                              32
#define NVMNW_BANK2TRIM1_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK2TRIM1_VAL_S                                               0
#define NVMNW_BANK2TRIM1_VAL_MAXIMUM                                0x0FFFFFFF
#define NVMNW_BANK2TRIM1_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK3TRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK3TRIM0_VAL_W                                              32
#define NVMNW_BANK3TRIM0_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK3TRIM0_VAL_S                                               0
#define NVMNW_BANK3TRIM0_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_BANK3TRIM0_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK3TRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK3TRIM1_VAL_W                                              32
#define NVMNW_BANK3TRIM1_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK3TRIM1_VAL_S                                               0
#define NVMNW_BANK3TRIM1_VAL_MAXIMUM                                0x0FFFFFFF
#define NVMNW_BANK3TRIM1_VAL_MINIMUM                                0x00000000

