espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_nvmnw.h
//*****************************************************************************
//
// Register: NVMNW_O_BANK4TRIM0
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK4TRIM0_VAL_W                                              32
#define NVMNW_BANK4TRIM0_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK4TRIM0_VAL_S                                               0
#define NVMNW_BANK4TRIM0_VAL_MAXIMUM                                0xFFFFFFFF
#define NVMNW_BANK4TRIM0_VAL_MINIMUM                                0x00000000

//*****************************************************************************
//
// Register: NVMNW_O_BANK4TRIM1
//
//*****************************************************************************
// Field:  [31:0] VAL
//
// Trim Data Value
// ENUMs:
// MAXIMUM                  Maximum value of VAL
// MINIMUM                  Minimum value of VAL
#define NVMNW_BANK4TRIM1_VAL_W                                              32
#define NVMNW_BANK4TRIM1_VAL_M                                      0xFFFFFFFF
#define NVMNW_BANK4TRIM1_VAL_S                                               0
#define NVMNW_BANK4TRIM1_VAL_MAXIMUM                                0x0FFFFFFF
#define NVMNW_BANK4TRIM1_VAL_MINIMUM                                0x00000000


#endif // __NVMNW__
